iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMD21/targetInit/SAMD21_sfr.h
struct System_Control_Space_SysTick_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t ENABLE:1;
			uint64_t TICKINT:1;
			uint64_t CLKSOURCE:1;
			uint64_t reservedSpace0:13;
			uint64_t COUNTFLAG:1;
		} __attribute__((packed)) B;
	} SYST_CSR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t RELOAD:24;
		} __attribute__((packed)) B;
	} SYST_RVR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CURRENT:24;
		} __attribute__((packed)) B;
	} SYST_CVR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t TENMS:24;
			uint64_t reservedSpace0:6;
			uint64_t SKEW:1;
			uint64_t NOREF:1;
		} __attribute__((packed)) B;
	} SYST_CALIB;

} __attribute__((packed));

#define System_Control_Space_SysTick (*(volatile struct System_Control_Space_SysTick_tag *) 0xe000e010)

struct AC_tag
{
	union
	{
		uint8_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t RUNSTDBY:1;
			uint64_t reservedSpace0:4;
			uint64_t LPMUX:1;
		} __attribute__((packed)) B;
	} AC_CTRLA;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t START0:1;
			uint64_t START1:1;
		} __attribute__((packed)) B;
	} AC_CTRLB;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t COMPEO0:1;
			uint64_t COMPEO1:1;
			uint64_t reservedSpace0:2;
			uint64_t WINEO0:1;
			uint64_t reservedSpace1:3;
			uint64_t COMPEI0:1;
			uint64_t COMPEI1:1;
		} __attribute__((packed)) B;
	} AC_EVCTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t COMP0:1;
			uint64_t COMP1:1;
			uint64_t reservedSpace0:2;
			uint64_t WIN0:1;
		} __attribute__((packed)) B;
	} AC_INTENCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t COMP0:1;
			uint64_t COMP1:1;
			uint64_t reservedSpace0:2;
			uint64_t WIN0:1;
		} __attribute__((packed)) B;
	} AC_INTENSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t COMP0:1;
			uint64_t COMP1:1;
			uint64_t reservedSpace0:2;
			uint64_t WIN0:1;
		} __attribute__((packed)) B;
	} AC_INTFLAG;

	uint8_t res0[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t STATE0:1;
			uint64_t STATE1:1;
			uint64_t reservedSpace0:2;
			uint64_t WSTATE0:2;
		} __attribute__((packed)) B;
	} AC_STATUSA;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t READY0:1;
			uint64_t READY1:1;
			uint64_t reservedSpace0:5;
			uint64_t SYNCBUSY:1;
		} __attribute__((packed)) B;
	} AC_STATUSB;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t STATE0:1;
			uint64_t STATE1:1;
			uint64_t reservedSpace0:2;
			uint64_t WSTATE0:2;
		} __attribute__((packed)) B;
	} AC_STATUSC;

	uint8_t res1[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t WEN0:1;
			uint64_t WINTSEL0:2;
		} __attribute__((packed)) B;
	} AC_WINCTRL;

	uint8_t res2[3];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ENABLE:1;
			uint64_t SINGLE:1;
			uint64_t SPEED:2;
			uint64_t reservedSpace0:1;
			uint64_t INTSEL:2;
			uint64_t reservedSpace1:1;
			uint64_t MUXNEG:3;
			uint64_t reservedSpace2:1;
			uint64_t MUXPOS:2;
			uint64_t reservedSpace3:1;
			uint64_t SWAP:1;
			uint64_t OUT:2;
			uint64_t reservedSpace4:1;
			uint64_t HYST:1;
			uint64_t reservedSpace5:4;
			uint64_t FLEN:3;
		} __attribute__((packed)) B;
	} AC_COMPCTRL0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ENABLE:1;
			uint64_t SINGLE:1;
			uint64_t SPEED:2;
			uint64_t reservedSpace0:1;
			uint64_t INTSEL:2;
			uint64_t reservedSpace1:1;
			uint64_t MUXNEG:3;
			uint64_t reservedSpace2:1;
			uint64_t MUXPOS:2;
			uint64_t reservedSpace3:1;
			uint64_t SWAP:1;
			uint64_t OUT:2;
			uint64_t reservedSpace4:1;
			uint64_t HYST:1;
			uint64_t reservedSpace5:4;
			uint64_t FLEN:3;
		} __attribute__((packed)) B;
	} AC_COMPCTRL1;

	uint8_t res3[8];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t VALUE:6;
		} __attribute__((packed)) B;
	} AC_SCALER0;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t VALUE:6;
		} __attribute__((packed)) B;
	} AC_SCALER1;

} __attribute__((packed));

#define AC (*(volatile struct AC_tag *) 0x42004400)

struct ADC_tag
{
	union
	{
		uint8_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t RUNSTDBY:1;
		} __attribute__((packed)) B;
	} ADC_CTRLA;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t REFSEL:4;
			uint64_t reservedSpace0:3;
			uint64_t REFCOMP:1;
		} __attribute__((packed)) B;
	} ADC_REFCTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t SAMPLENUM:4;
			uint64_t ADJRES:3;
		} __attribute__((packed)) B;
	} ADC_AVGCTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t SAMPLEN:6;
		} __attribute__((packed)) B;
	} ADC_SAMPCTRL;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t DIFFMODE:1;
			uint64_t LEFTADJ:1;
			uint64_t FREERUN:1;
			uint64_t CORREN:1;
			uint64_t RESSEL:2;
			uint64_t reservedSpace0:2;
			uint64_t PRESCALER:3;
		} __attribute__((packed)) B;
	} ADC_CTRLB;

	uint8_t res0[2];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t WINMODE:3;
		} __attribute__((packed)) B;
	} ADC_WINCTRL;

	uint8_t res1[3];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t FLUSH:1;
			uint64_t START:1;
		} __attribute__((packed)) B;
	} ADC_SWTRIG;

	uint8_t res2[3];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MUXPOS:5;
			uint64_t reservedSpace0:3;
			uint64_t MUXNEG:5;
			uint64_t reservedSpace1:3;
			uint64_t INPUTSCAN:4;
			uint64_t INPUTOFFSET:4;
			uint64_t GAIN:4;
		} __attribute__((packed)) B;
	} ADC_INPUTCTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t STARTEI:1;
			uint64_t SYNCEI:1;
			uint64_t reservedSpace0:2;
			uint64_t RESRDYEO:1;
			uint64_t WINMONEO:1;
		} __attribute__((packed)) B;
	} ADC_EVCTRL;

	uint8_t res3[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t RESRDY:1;
			uint64_t OVERRUN:1;
			uint64_t WINMON:1;
			uint64_t SYNCRDY:1;
		} __attribute__((packed)) B;
	} ADC_INTENCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t RESRDY:1;
			uint64_t OVERRUN:1;
			uint64_t WINMON:1;
			uint64_t SYNCRDY:1;
		} __attribute__((packed)) B;
	} ADC_INTENSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t RESRDY:1;
			uint64_t OVERRUN:1;
			uint64_t WINMON:1;
			uint64_t SYNCRDY:1;
		} __attribute__((packed)) B;
	} ADC_INTFLAG;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:7;
			uint64_t SYNCBUSY:1;
		} __attribute__((packed)) B;
	} ADC_STATUS;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t RESULT:16;
		} __attribute__((packed)) B;
	} ADC_RESULT;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t WINLT:16;
		} __attribute__((packed)) B;
	} ADC_WINLT;

	uint8_t res4[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t WINUT:16;
		} __attribute__((packed)) B;
	} ADC_WINUT;

	uint8_t res5[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t GAINCORR:12;
		} __attribute__((packed)) B;
	} ADC_GAINCORR;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t OFFSETCORR:12;
		} __attribute__((packed)) B;
	} ADC_OFFSETCORR;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t LINEARITY_CAL:8;
			uint64_t BIAS_CAL:3;
		} __attribute__((packed)) B;
	} ADC_CALIB;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DBGRUN:1;
		} __attribute__((packed)) B;
	} ADC_DBGCTRL;

} __attribute__((packed));

