iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMD21/targetInit/SAMD21_sfr.h
#define ADC (*(volatile struct ADC_tag *) 0x42004000)

struct DAC_tag
{
	union
	{
		uint8_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t RUNSTDBY:1;
		} __attribute__((packed)) B;
	} DAC_CTRLA;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t EOEN:1;
			uint64_t IOEN:1;
			uint64_t LEFTADJ:1;
			uint64_t VPD:1;
			uint64_t BDWP:1;
			uint64_t reservedSpace0:1;
			uint64_t REFSEL:2;
		} __attribute__((packed)) B;
	} DAC_CTRLB;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t STARTEI:1;
			uint64_t EMPTYEO:1;
		} __attribute__((packed)) B;
	} DAC_EVCTRL;

	uint8_t res0[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t UNDERRUN:1;
			uint64_t EMPTY:1;
			uint64_t SYNCRDY:1;
		} __attribute__((packed)) B;
	} DAC_INTENCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t UNDERRUN:1;
			uint64_t EMPTY:1;
			uint64_t SYNCRDY:1;
		} __attribute__((packed)) B;
	} DAC_INTENSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t UNDERRUN:1;
			uint64_t EMPTY:1;
			uint64_t SYNCRDY:1;
		} __attribute__((packed)) B;
	} DAC_INTFLAG;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:7;
			uint64_t SYNCBUSY:1;
		} __attribute__((packed)) B;
	} DAC_STATUS;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t DATA:16;
		} __attribute__((packed)) B;
	} DAC_DATA;

	uint8_t res1[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t DATABUF:16;
		} __attribute__((packed)) B;
	} DAC_DATABUF;

} __attribute__((packed));

#define DAC (*(volatile struct DAC_tag *) 0x42004800)

struct DMAC_tag
{
	union
	{
		uint16_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t DMAENABLE:1;
			uint64_t CRCENABLE:1;
			uint64_t reservedSpace0:5;
			uint64_t LVLEN0:1;
			uint64_t LVLEN1:1;
			uint64_t LVLEN2:1;
			uint64_t LVLEN3:1;
		} __attribute__((packed)) B;
	} DMAC_CTRL;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t CRCBEATSIZE:2;
			uint64_t CRCPOLY:2;
			uint64_t reservedSpace0:4;
			uint64_t CRCSRC:6;
		} __attribute__((packed)) B;
	} DMAC_CRCCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CRCDATAIN:32;
		} __attribute__((packed)) B;
	} DMAC_CRCDATAIN;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CRCCHKSUM:32;
		} __attribute__((packed)) B;
	} DMAC_CRCCHKSUM;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t CRCBUSY:1;
			uint64_t CRCZERO:1;
		} __attribute__((packed)) B;
	} DMAC_CRCSTATUS;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DBGRUN:1;
		} __attribute__((packed)) B;
	} DMAC_DBGCTRL;

	uint8_t res0[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SWTRIG0:1;
			uint64_t SWTRIG1:1;
			uint64_t SWTRIG2:1;
			uint64_t SWTRIG3:1;
			uint64_t SWTRIG4:1;
			uint64_t SWTRIG5:1;
			uint64_t SWTRIG6:1;
			uint64_t SWTRIG7:1;
			uint64_t SWTRIG8:1;
			uint64_t SWTRIG9:1;
			uint64_t SWTRIG10:1;
			uint64_t SWTRIG11:1;
		} __attribute__((packed)) B;
	} DMAC_SWTRIGCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LVLPRI0:4;
			uint64_t reservedSpace0:3;
			uint64_t RRLVLEN0:1;
			uint64_t LVLPRI1:4;
			uint64_t reservedSpace1:3;
			uint64_t RRLVLEN1:1;
			uint64_t LVLPRI2:4;
			uint64_t reservedSpace2:3;
			uint64_t RRLVLEN2:1;
			uint64_t LVLPRI3:4;
			uint64_t reservedSpace3:3;
			uint64_t RRLVLEN3:1;
		} __attribute__((packed)) B;
	} DMAC_PRICTRL0;

	uint8_t res1[8];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t ID:4;
			uint64_t reservedSpace0:4;
			uint64_t TERR:1;
			uint64_t TCMPL:1;
			uint64_t SUSP:1;
			uint64_t reservedSpace1:2;
			uint64_t FERR:1;
			uint64_t BUSY:1;
			uint64_t PEND:1;
		} __attribute__((packed)) B;
	} DMAC_INTPEND;

	uint8_t res2[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CHINT0:1;
			uint64_t CHINT1:1;
			uint64_t CHINT2:1;
			uint64_t CHINT3:1;
			uint64_t CHINT4:1;
			uint64_t CHINT5:1;
			uint64_t CHINT6:1;
			uint64_t CHINT7:1;
			uint64_t CHINT8:1;
			uint64_t CHINT9:1;
			uint64_t CHINT10:1;
			uint64_t CHINT11:1;
		} __attribute__((packed)) B;
	} DMAC_INTSTATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t BUSYCH0:1;
			uint64_t BUSYCH1:1;
			uint64_t BUSYCH2:1;
			uint64_t BUSYCH3:1;
			uint64_t BUSYCH4:1;
			uint64_t BUSYCH5:1;
			uint64_t BUSYCH6:1;
			uint64_t BUSYCH7:1;
			uint64_t BUSYCH8:1;
			uint64_t BUSYCH9:1;
			uint64_t BUSYCH10:1;
			uint64_t BUSYCH11:1;
		} __attribute__((packed)) B;
	} DMAC_BUSYCH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PENDCH0:1;
			uint64_t PENDCH1:1;
			uint64_t PENDCH2:1;
			uint64_t PENDCH3:1;
			uint64_t PENDCH4:1;
			uint64_t PENDCH5:1;
			uint64_t PENDCH6:1;
			uint64_t PENDCH7:1;
			uint64_t PENDCH8:1;
			uint64_t PENDCH9:1;
			uint64_t PENDCH10:1;
			uint64_t PENDCH11:1;
		} __attribute__((packed)) B;
	} DMAC_PENDCH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LVLEX0:1;
			uint64_t LVLEX1:1;
			uint64_t LVLEX2:1;
			uint64_t LVLEX3:1;
			uint64_t reservedSpace0:4;
			uint64_t ID:5;
			uint64_t reservedSpace1:2;
			uint64_t ABUSY:1;
			uint64_t BTCNT:16;
		} __attribute__((packed)) B;
	} DMAC_ACTIVE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t BASEADDR:32;
		} __attribute__((packed)) B;
	} DMAC_BASEADDR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t WRBADDR:32;
		} __attribute__((packed)) B;
	} DMAC_WRBADDR;

	uint8_t res3[3];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t ID:4;
		} __attribute__((packed)) B;
	} DMAC_CHID;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
		} __attribute__((packed)) B;
	} DMAC_CHCTRLA;

	uint8_t res4[3];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EVACT:3;
			uint64_t EVIE:1;
			uint64_t EVOE:1;
			uint64_t LVL:2;
			uint64_t reservedSpace0:1;
			uint64_t TRIGSRC:6;
			uint64_t reservedSpace1:8;
			uint64_t TRIGACT:2;
			uint64_t CMD:2;
		} __attribute__((packed)) B;
	} DMAC_CHCTRLB;

	uint8_t res5[4];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TERR:1;
			uint64_t TCMPL:1;
			uint64_t SUSP:1;
		} __attribute__((packed)) B;
	} DMAC_CHINTENCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TERR:1;
			uint64_t TCMPL:1;
			uint64_t SUSP:1;
		} __attribute__((packed)) B;
	} DMAC_CHINTENSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TERR:1;
			uint64_t TCMPL:1;
			uint64_t SUSP:1;
		} __attribute__((packed)) B;
	} DMAC_CHINTFLAG;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t PEND:1;
			uint64_t BUSY:1;
			uint64_t FERR:1;
		} __attribute__((packed)) B;
	} DMAC_CHSTATUS;

} __attribute__((packed));

