iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMD21/targetInit/SAMD21_sfr.h
#define DMAC (*(volatile struct DMAC_tag *) 0x41004800)

struct DSU_tag
{
	union
	{
		uint8_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t reservedSpace0:1;
			uint64_t CRC:1;
			uint64_t MBIST:1;
			uint64_t CE:1;
		} __attribute__((packed)) B;
	} DSU_CTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DONE:1;
			uint64_t CRSTEXT:1;
			uint64_t BERR:1;
			uint64_t FAIL:1;
			uint64_t PERR:1;
		} __attribute__((packed)) B;
	} DSU_STATUSA;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t PROT:1;
			uint64_t DBGPRES:1;
			uint64_t DCCD0:1;
			uint64_t DCCD1:1;
			uint64_t HPE:1;
		} __attribute__((packed)) B;
	} DSU_STATUSB;

	uint8_t res0[1];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:2;
			uint64_t ADDR:30;
		} __attribute__((packed)) B;
	} DSU_ADDR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:2;
			uint64_t LENGTH:30;
		} __attribute__((packed)) B;
	} DSU_LENGTH;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:32;
		} __attribute__((packed)) B;
	} DSU_DATA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:32;
		} __attribute__((packed)) B;
	} DSU_DCC0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:32;
		} __attribute__((packed)) B;
	} DSU_DCC1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DEVSEL:8;
			uint64_t REVISION:4;
			uint64_t DIE:4;
			uint64_t SERIES:6;
			uint64_t reservedSpace0:1;
			uint64_t FAMILY:5;
			uint64_t PROCESSOR:4;
		} __attribute__((packed)) B;
	} DSU_DID;

	uint8_t res1[4068];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EPRES:1;
			uint64_t FMT:1;
			uint64_t reservedSpace0:10;
			uint64_t ADDOFF:20;
		} __attribute__((packed)) B;
	} DSU_ENTRY0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EPRES:1;
			uint64_t FMT:1;
			uint64_t reservedSpace0:10;
			uint64_t ADDOFF:20;
		} __attribute__((packed)) B;
	} DSU_ENTRY1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t END:32;
		} __attribute__((packed)) B;
	} DSU_END;

	uint8_t res2[4032];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SMEMP:1;
		} __attribute__((packed)) B;
	} DSU_MEMTYPE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t JEPCC:4;
			uint64_t FKBC:4;
		} __attribute__((packed)) B;
	} DSU_PID4;

	uint8_t res3[12];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PARTNBL:8;
		} __attribute__((packed)) B;
	} DSU_PID0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PARTNBH:4;
			uint64_t JEPIDCL:4;
		} __attribute__((packed)) B;
	} DSU_PID1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t JEPIDCH:3;
			uint64_t JEPU:1;
			uint64_t REVISION:4;
		} __attribute__((packed)) B;
	} DSU_PID2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CUSMOD:4;
			uint64_t REVAND:4;
		} __attribute__((packed)) B;
	} DSU_PID3;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PREAMBLEB0:8;
		} __attribute__((packed)) B;
	} DSU_CID0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PREAMBLE:4;
			uint64_t CCLASS:4;
		} __attribute__((packed)) B;
	} DSU_CID1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PREAMBLEB2:8;
		} __attribute__((packed)) B;
	} DSU_CID2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PREAMBLEB3:8;
		} __attribute__((packed)) B;
	} DSU_CID3;

} __attribute__((packed));

#define DSU (*(volatile struct DSU_tag *) 0x41002000)

struct EIC_tag
{
	union
	{
		uint8_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
		} __attribute__((packed)) B;
	} EIC_CTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:7;
			uint64_t SYNCBUSY:1;
		} __attribute__((packed)) B;
	} EIC_STATUS;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t NMISENSE:3;
			uint64_t NMIFILTEN:1;
		} __attribute__((packed)) B;
	} EIC_NMICTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t NMI:1;
		} __attribute__((packed)) B;
	} EIC_NMIFLAG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTINTEO0:1;
			uint64_t EXTINTEO1:1;
			uint64_t EXTINTEO2:1;
			uint64_t EXTINTEO3:1;
			uint64_t EXTINTEO4:1;
			uint64_t EXTINTEO5:1;
			uint64_t EXTINTEO6:1;
			uint64_t EXTINTEO7:1;
			uint64_t EXTINTEO8:1;
			uint64_t EXTINTEO9:1;
			uint64_t EXTINTEO10:1;
			uint64_t EXTINTEO11:1;
			uint64_t EXTINTEO12:1;
			uint64_t EXTINTEO13:1;
			uint64_t EXTINTEO14:1;
			uint64_t EXTINTEO15:1;
		} __attribute__((packed)) B;
	} EIC_EVCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTINT0:1;
			uint64_t EXTINT1:1;
			uint64_t EXTINT2:1;
			uint64_t EXTINT3:1;
			uint64_t EXTINT4:1;
			uint64_t EXTINT5:1;
			uint64_t EXTINT6:1;
			uint64_t EXTINT7:1;
			uint64_t EXTINT8:1;
			uint64_t EXTINT9:1;
			uint64_t EXTINT10:1;
			uint64_t EXTINT11:1;
			uint64_t EXTINT12:1;
			uint64_t EXTINT13:1;
			uint64_t EXTINT14:1;
			uint64_t EXTINT15:1;
		} __attribute__((packed)) B;
	} EIC_INTENCLR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTINT0:1;
			uint64_t EXTINT1:1;
			uint64_t EXTINT2:1;
			uint64_t EXTINT3:1;
			uint64_t EXTINT4:1;
			uint64_t EXTINT5:1;
			uint64_t EXTINT6:1;
			uint64_t EXTINT7:1;
			uint64_t EXTINT8:1;
			uint64_t EXTINT9:1;
			uint64_t EXTINT10:1;
			uint64_t EXTINT11:1;
			uint64_t EXTINT12:1;
			uint64_t EXTINT13:1;
			uint64_t EXTINT14:1;
			uint64_t EXTINT15:1;
		} __attribute__((packed)) B;
	} EIC_INTENSET;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EXTINT0:1;
			uint64_t EXTINT1:1;
			uint64_t EXTINT2:1;
			uint64_t EXTINT3:1;
			uint64_t EXTINT4:1;
			uint64_t EXTINT5:1;
			uint64_t EXTINT6:1;
			uint64_t EXTINT7:1;
			uint64_t EXTINT8:1;
			uint64_t EXTINT9:1;
			uint64_t EXTINT10:1;
			uint64_t EXTINT11:1;
			uint64_t EXTINT12:1;
			uint64_t EXTINT13:1;
			uint64_t EXTINT14:1;
			uint64_t EXTINT15:1;
		} __attribute__((packed)) B;
	} EIC_INTFLAG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t WAKEUPEN0:1;
			uint64_t WAKEUPEN1:1;
			uint64_t WAKEUPEN2:1;
			uint64_t WAKEUPEN3:1;
			uint64_t WAKEUPEN4:1;
			uint64_t WAKEUPEN5:1;
			uint64_t WAKEUPEN6:1;
			uint64_t WAKEUPEN7:1;
			uint64_t WAKEUPEN8:1;
			uint64_t WAKEUPEN9:1;
			uint64_t WAKEUPEN10:1;
			uint64_t WAKEUPEN11:1;
			uint64_t WAKEUPEN12:1;
			uint64_t WAKEUPEN13:1;
			uint64_t WAKEUPEN14:1;
			uint64_t WAKEUPEN15:1;
		} __attribute__((packed)) B;
	} EIC_WAKEUP;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SENSE0:3;
			uint64_t FILTEN0:1;
			uint64_t SENSE1:3;
			uint64_t FILTEN1:1;
			uint64_t SENSE2:3;
			uint64_t FILTEN2:1;
			uint64_t SENSE3:3;
			uint64_t FILTEN3:1;
			uint64_t SENSE4:3;
			uint64_t FILTEN4:1;
			uint64_t SENSE5:3;
			uint64_t FILTEN5:1;
			uint64_t SENSE6:3;
			uint64_t FILTEN6:1;
			uint64_t SENSE7:3;
			uint64_t FILTEN7:1;
		} __attribute__((packed)) B;
	} EIC_CONFIG0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SENSE0:3;
			uint64_t FILTEN0:1;
			uint64_t SENSE1:3;
			uint64_t FILTEN1:1;
			uint64_t SENSE2:3;
			uint64_t FILTEN2:1;
			uint64_t SENSE3:3;
			uint64_t FILTEN3:1;
			uint64_t SENSE4:3;
			uint64_t FILTEN4:1;
			uint64_t SENSE5:3;
			uint64_t FILTEN5:1;
			uint64_t SENSE6:3;
			uint64_t FILTEN6:1;
			uint64_t SENSE7:3;
			uint64_t FILTEN7:1;
		} __attribute__((packed)) B;
	} EIC_CONFIG1;

} __attribute__((packed));

#define EIC (*(volatile struct EIC_tag *) 0x40001800)

struct EVSYS_tag
{
	union
	{
		uint8_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t reservedSpace0:3;
			uint64_t GCLKREQ:1;
		} __attribute__((packed)) B;
	} EVSYS_CTRL;

	uint8_t res0[3];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CHANNEL:4;
			uint64_t reservedSpace0:4;
			uint64_t SWEVT:1;
			uint64_t reservedSpace1:7;
			uint64_t EVGEN:7;
			uint64_t reservedSpace2:1;
			uint64_t PATH:2;
			uint64_t EDGSEL:2;
		} __attribute__((packed)) B;
	} EVSYS_CHANNEL;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t USER:5;
			uint64_t reservedSpace0:3;
			uint64_t CHANNEL:5;
		} __attribute__((packed)) B;
	} EVSYS_USER;

	uint8_t res1[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t USRRDY0:1;
			uint64_t USRRDY1:1;
			uint64_t USRRDY2:1;
			uint64_t USRRDY3:1;
			uint64_t USRRDY4:1;
			uint64_t USRRDY5:1;
			uint64_t USRRDY6:1;
			uint64_t USRRDY7:1;
			uint64_t CHBUSY0:1;
			uint64_t CHBUSY1:1;
			uint64_t CHBUSY2:1;
			uint64_t CHBUSY3:1;
			uint64_t CHBUSY4:1;
			uint64_t CHBUSY5:1;
			uint64_t CHBUSY6:1;
			uint64_t CHBUSY7:1;
			uint64_t USRRDY8:1;
			uint64_t USRRDY9:1;
			uint64_t USRRDY10:1;
			uint64_t USRRDY11:1;
			uint64_t reservedSpace0:4;
			uint64_t CHBUSY8:1;
			uint64_t CHBUSY9:1;
			uint64_t CHBUSY10:1;
			uint64_t CHBUSY11:1;
		} __attribute__((packed)) B;
	} EVSYS_CHSTATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVR0:1;
			uint64_t OVR1:1;
			uint64_t OVR2:1;
			uint64_t OVR3:1;
			uint64_t OVR4:1;
			uint64_t OVR5:1;
			uint64_t OVR6:1;
			uint64_t OVR7:1;
			uint64_t EVD0:1;
			uint64_t EVD1:1;
			uint64_t EVD2:1;
			uint64_t EVD3:1;
			uint64_t EVD4:1;
			uint64_t EVD5:1;
			uint64_t EVD6:1;
			uint64_t EVD7:1;
			uint64_t OVR8:1;
			uint64_t OVR9:1;
			uint64_t OVR10:1;
			uint64_t OVR11:1;
			uint64_t reservedSpace0:4;
			uint64_t EVD8:1;
			uint64_t EVD9:1;
			uint64_t EVD10:1;
			uint64_t EVD11:1;
		} __attribute__((packed)) B;
	} EVSYS_INTENCLR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVR0:1;
			uint64_t OVR1:1;
			uint64_t OVR2:1;
			uint64_t OVR3:1;
			uint64_t OVR4:1;
			uint64_t OVR5:1;
			uint64_t OVR6:1;
			uint64_t OVR7:1;
			uint64_t EVD0:1;
			uint64_t EVD1:1;
			uint64_t EVD2:1;
			uint64_t EVD3:1;
			uint64_t EVD4:1;
			uint64_t EVD5:1;
			uint64_t EVD6:1;
			uint64_t EVD7:1;
			uint64_t OVR8:1;
			uint64_t OVR9:1;
			uint64_t OVR10:1;
			uint64_t OVR11:1;
			uint64_t reservedSpace0:4;
			uint64_t EVD8:1;
			uint64_t EVD9:1;
			uint64_t EVD10:1;
			uint64_t EVD11:1;
		} __attribute__((packed)) B;
	} EVSYS_INTENSET;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVR0:1;
			uint64_t OVR1:1;
			uint64_t OVR2:1;
			uint64_t OVR3:1;
			uint64_t OVR4:1;
			uint64_t OVR5:1;
			uint64_t OVR6:1;
			uint64_t OVR7:1;
			uint64_t EVD0:1;
			uint64_t EVD1:1;
			uint64_t EVD2:1;
			uint64_t EVD3:1;
			uint64_t EVD4:1;
			uint64_t EVD5:1;
			uint64_t EVD6:1;
			uint64_t EVD7:1;
			uint64_t OVR8:1;
			uint64_t OVR9:1;
			uint64_t OVR10:1;
			uint64_t OVR11:1;
			uint64_t reservedSpace0:4;
			uint64_t EVD8:1;
			uint64_t EVD9:1;
			uint64_t EVD10:1;
			uint64_t EVD11:1;
		} __attribute__((packed)) B;
	} EVSYS_INTFLAG;

} __attribute__((packed));

#define EVSYS (*(volatile struct EVSYS_tag *) 0x42000400)

struct GCLK_tag
{
	union
	{
		uint8_t R;
		struct
		{
			uint64_t SWRST:1;
		} __attribute__((packed)) B;
	} GCLK_CTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:7;
			uint64_t SYNCBUSY:1;
		} __attribute__((packed)) B;
	} GCLK_STATUS;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t ID:6;
			uint64_t reservedSpace0:2;
			uint64_t GEN:4;
			uint64_t reservedSpace1:2;
			uint64_t CLKEN:1;
			uint64_t WRTLOCK:1;
		} __attribute__((packed)) B;
	} GCLK_CLKCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ID:4;
			uint64_t reservedSpace0:4;
			uint64_t SRC:5;
			uint64_t reservedSpace1:3;
			uint64_t GENEN:1;
			uint64_t IDC:1;
			uint64_t OOV:1;
			uint64_t OE:1;
			uint64_t DIVSEL:1;
			uint64_t RUNSTDBY:1;
		} __attribute__((packed)) B;
	} GCLK_GENCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ID:4;
			uint64_t reservedSpace0:4;
			uint64_t DIV:16;
		} __attribute__((packed)) B;
	} GCLK_GENDIV;

} __attribute__((packed));

#define GCLK (*(volatile struct GCLK_tag *) 0x40000c00)

struct I2S_tag
{
	union
	{
		uint8_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t CKEN0:1;
			uint64_t CKEN1:1;
			uint64_t SEREN0:1;
			uint64_t SEREN1:1;
		} __attribute__((packed)) B;
	} I2S_CTRLA;

	uint8_t res0[3];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SLOTSIZE:2;
			uint64_t NBSLOTS:3;
			uint64_t FSWIDTH:2;
			uint64_t BITDELAY:1;
			uint64_t FSSEL:1;
			uint64_t reservedSpace0:2;
			uint64_t FSINV:1;
			uint64_t SCKSEL:1;
			uint64_t reservedSpace1:3;
			uint64_t MCKSEL:1;
			uint64_t reservedSpace2:1;
			uint64_t MCKEN:1;
			uint64_t MCKDIV:5;
			uint64_t MCKOUTDIV:5;
			uint64_t FSOUTINV:1;
			uint64_t SCKOUTINV:1;
			uint64_t MCKOUTINV:1;
		} __attribute__((packed)) B;
	} I2S_CLKCTRL0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SLOTSIZE:2;
			uint64_t NBSLOTS:3;
			uint64_t FSWIDTH:2;
			uint64_t BITDELAY:1;
			uint64_t FSSEL:1;
			uint64_t reservedSpace0:2;
			uint64_t FSINV:1;
			uint64_t SCKSEL:1;
			uint64_t reservedSpace1:3;
			uint64_t MCKSEL:1;
			uint64_t reservedSpace2:1;
			uint64_t MCKEN:1;
			uint64_t MCKDIV:5;
			uint64_t MCKOUTDIV:5;
			uint64_t FSOUTINV:1;
			uint64_t SCKOUTINV:1;
			uint64_t MCKOUTINV:1;
		} __attribute__((packed)) B;
	} I2S_CLKCTRL1;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t RXRDY0:1;
			uint64_t RXRDY1:1;
			uint64_t reservedSpace0:2;
			uint64_t RXOR0:1;
			uint64_t RXOR1:1;
			uint64_t reservedSpace1:2;
			uint64_t TXRDY0:1;
			uint64_t TXRDY1:1;
			uint64_t reservedSpace2:2;
			uint64_t TXUR0:1;
			uint64_t TXUR1:1;
		} __attribute__((packed)) B;
	} I2S_INTENCLR;

	uint8_t res1[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t RXRDY0:1;
			uint64_t RXRDY1:1;
			uint64_t reservedSpace0:2;
			uint64_t RXOR0:1;
			uint64_t RXOR1:1;
			uint64_t reservedSpace1:2;
			uint64_t TXRDY0:1;
			uint64_t TXRDY1:1;
			uint64_t reservedSpace2:2;
			uint64_t TXUR0:1;
			uint64_t TXUR1:1;
		} __attribute__((packed)) B;
	} I2S_INTENSET;

	uint8_t res2[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t RXRDY0:1;
			uint64_t RXRDY1:1;
			uint64_t reservedSpace0:2;
			uint64_t RXOR0:1;
			uint64_t RXOR1:1;
			uint64_t reservedSpace1:2;
			uint64_t TXRDY0:1;
			uint64_t TXRDY1:1;
			uint64_t reservedSpace2:2;
			uint64_t TXUR0:1;
			uint64_t TXUR1:1;
		} __attribute__((packed)) B;
	} I2S_INTFLAG;

	uint8_t res3[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t CKEN0:1;
			uint64_t CKEN1:1;
			uint64_t SEREN0:1;
			uint64_t SEREN1:1;
			uint64_t reservedSpace0:2;
			uint64_t DATA0:1;
			uint64_t DATA1:1;
		} __attribute__((packed)) B;
	} I2S_SYNCBUSY;

	uint8_t res4[6];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SERMODE:2;
			uint64_t TXDEFAULT:2;
			uint64_t TXSAME:1;
			uint64_t CLKSEL:1;
			uint64_t reservedSpace0:1;
			uint64_t SLOTADJ:1;
			uint64_t DATASIZE:3;
			uint64_t reservedSpace1:1;
			uint64_t WORDADJ:1;
			uint64_t EXTEND:2;
			uint64_t BITREV:1;
			uint64_t SLOTDIS0:1;
			uint64_t SLOTDIS1:1;
			uint64_t SLOTDIS2:1;
			uint64_t SLOTDIS3:1;
			uint64_t SLOTDIS4:1;
			uint64_t SLOTDIS5:1;
			uint64_t SLOTDIS6:1;
			uint64_t SLOTDIS7:1;
			uint64_t MONO:1;
			uint64_t DMA:1;
			uint64_t RXLOOP:1;
		} __attribute__((packed)) B;
	} I2S_SERCTRL0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SERMODE:2;
			uint64_t TXDEFAULT:2;
			uint64_t TXSAME:1;
			uint64_t CLKSEL:1;
			uint64_t reservedSpace0:1;
			uint64_t SLOTADJ:1;
			uint64_t DATASIZE:3;
			uint64_t reservedSpace1:1;
			uint64_t WORDADJ:1;
			uint64_t EXTEND:2;
			uint64_t BITREV:1;
			uint64_t SLOTDIS0:1;
			uint64_t SLOTDIS1:1;
			uint64_t SLOTDIS2:1;
			uint64_t SLOTDIS3:1;
			uint64_t SLOTDIS4:1;
			uint64_t SLOTDIS5:1;
			uint64_t SLOTDIS6:1;
			uint64_t SLOTDIS7:1;
			uint64_t MONO:1;
			uint64_t DMA:1;
			uint64_t RXLOOP:1;
		} __attribute__((packed)) B;
	} I2S_SERCTRL1;

