iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMD21/targetInit/SAMD21_sfr.h
	uint8_t res5[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:32;
		} __attribute__((packed)) B;
	} I2S_DATA0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DATA:32;
		} __attribute__((packed)) B;
	} I2S_DATA1;

} __attribute__((packed));

#define I2S (*(volatile struct I2S_tag *) 0x42005000)

struct MTB_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:2;
			uint64_t WRAP:1;
			uint64_t POINTER:29;
		} __attribute__((packed)) B;
	} MTB_POSITION;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MASK:5;
			uint64_t TSTARTEN:1;
			uint64_t TSTOPEN:1;
			uint64_t SFRWPRIV:1;
			uint64_t RAMPRIV:1;
			uint64_t HALTREQ:1;
			uint64_t reservedSpace0:21;
			uint64_t EN:1;
		} __attribute__((packed)) B;
	} MTB_MASTER;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t AUTOSTOP:1;
			uint64_t AUTOHALT:1;
			uint64_t reservedSpace0:1;
			uint64_t WATERMARK:29;
		} __attribute__((packed)) B;
	} MTB_FLOW;

	uint32_t MTB_BASE;
	uint8_t res0[3824];

	uint32_t MTB_ITCTRL;
	uint8_t res1[156];

	uint32_t MTB_CLAIMSET;
	uint32_t MTB_CLAIMCLR;
	uint8_t res2[8];

	uint32_t MTB_LOCKACCESS;
	uint32_t MTB_LOCKSTATUS;
	uint32_t MTB_AUTHSTATUS;
	uint32_t MTB_DEVARCH;
	uint8_t res3[8];

	uint32_t MTB_DEVID;
	uint32_t MTB_DEVTYPE;
	uint32_t MTB_PID4;
	uint32_t MTB_PID5;
	uint32_t MTB_PID6;
	uint32_t MTB_PID7;
	uint32_t MTB_PID0;
	uint32_t MTB_PID1;
	uint32_t MTB_PID2;
	uint32_t MTB_PID3;
	uint32_t MTB_CID0;
	uint32_t MTB_CID1;
	uint32_t MTB_CID2;
	uint32_t MTB_CID3;
} __attribute__((packed));

#define MTB (*(volatile struct MTB_tag *) 0x41006000)

struct NVMCTRL_tag
{
	union
	{
		uint16_t R;
		struct
		{
			uint64_t CMD:7;
			uint64_t reservedSpace0:1;
			uint64_t CMDEX:8;
		} __attribute__((packed)) B;
	} NVMCTRL_CTRLA;

	uint8_t res0[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t RWS:4;
			uint64_t reservedSpace1:2;
			uint64_t MANW:1;
			uint64_t SLEEPPRM:2;
			uint64_t reservedSpace2:6;
			uint64_t READMODE:2;
			uint64_t CACHEDIS:1;
		} __attribute__((packed)) B;
	} NVMCTRL_CTRLB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t NVMP:16;
			uint64_t PSZ:3;
		} __attribute__((packed)) B;
	} NVMCTRL_PARAM;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t READY:1;
			uint64_t ERROR:1;
		} __attribute__((packed)) B;
	} NVMCTRL_INTENCLR;

	uint8_t res1[3];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t READY:1;
			uint64_t ERROR:1;
		} __attribute__((packed)) B;
	} NVMCTRL_INTENSET;

	uint8_t res2[3];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t READY:1;
			uint64_t ERROR:1;
		} __attribute__((packed)) B;
	} NVMCTRL_INTFLAG;

	uint8_t res3[3];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t PRM:1;
			uint64_t LOAD:1;
			uint64_t PROGE:1;
			uint64_t LOCKE:1;
			uint64_t NVME:1;
			uint64_t reservedSpace0:3;
			uint64_t SB:1;
		} __attribute__((packed)) B;
	} NVMCTRL_STATUS;

	uint8_t res4[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t ADDR:22;
		} __attribute__((packed)) B;
	} NVMCTRL_ADDR;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t LOCK:16;
		} __attribute__((packed)) B;
	} NVMCTRL_LOCK;

} __attribute__((packed));

#define NVMCTRL (*(volatile struct NVMCTRL_tag *) 0x41004000)

struct PAC0_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t WP:31;
		} __attribute__((packed)) B;
	} PAC_WPCLR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t WP:31;
		} __attribute__((packed)) B;
	} PAC_WPSET;

} __attribute__((packed));

#define PAC0 (*(volatile struct PAC0_tag *) 0x40000000)

struct PAC1_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t WP:31;
		} __attribute__((packed)) B;
	} PAC_WPCLR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t WP:31;
		} __attribute__((packed)) B;
	} PAC_WPSET;

} __attribute__((packed));

#define PAC1 (*(volatile struct PAC1_tag *) 0x41000000)

struct PAC2_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t WP:31;
		} __attribute__((packed)) B;
	} PAC_WPCLR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t WP:31;
		} __attribute__((packed)) B;
	} PAC_WPSET;

} __attribute__((packed));

#define PAC2 (*(volatile struct PAC2_tag *) 0x42000000)

struct PM_tag
{
	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:2;
			uint64_t CFDEN:1;
			uint64_t reservedSpace1:1;
			uint64_t BKUPCLK:1;
		} __attribute__((packed)) B;
	} PM_CTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t IDLE:2;
		} __attribute__((packed)) B;
	} PM_SLEEP;

	uint8_t res0[6];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t CPUDIV:3;
		} __attribute__((packed)) B;
	} PM_CPUSEL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t APBADIV:3;
		} __attribute__((packed)) B;
	} PM_APBASEL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t APBBDIV:3;
		} __attribute__((packed)) B;
	} PM_APBBSEL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t APBCDIV:3;
		} __attribute__((packed)) B;
	} PM_APBCSEL;

	uint8_t res1[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t HPB0:1;
			uint64_t HPB1:1;
			uint64_t HPB2:1;
			uint64_t DSU_bitfield:1;
			uint64_t NVMCTRL_bitfield:1;
			uint64_t DMAC_bitfield:1;
			uint64_t USB:1;
		} __attribute__((packed)) B;
	} PM_AHBMASK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PAC0_bitfield:1;
			uint64_t PM_bitfield:1;
			uint64_t SYSCTRL_bitfield:1;
			uint64_t GCLK_bitfield:1;
			uint64_t WDT_bitfield:1;
			uint64_t RTC:1;
			uint64_t EIC_bitfield:1;
		} __attribute__((packed)) B;
	} PM_APBAMASK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PAC1_bitfield:1;
			uint64_t DSU_bitfield:1;
			uint64_t NVMCTRL_bitfield:1;
			uint64_t PORT:1;
			uint64_t DMAC_bitfield:1;
			uint64_t USB:1;
		} __attribute__((packed)) B;
	} PM_APBBMASK;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PAC2_bitfield:1;
			uint64_t EVSYS_bitfield:1;
			uint64_t SERCOM0:1;
			uint64_t SERCOM1:1;
			uint64_t SERCOM2:1;
			uint64_t SERCOM3:1;
			uint64_t SERCOM4:1;
			uint64_t SERCOM5:1;
			uint64_t TCC0_bitfield:1;
			uint64_t TCC1_bitfield:1;
			uint64_t TCC2_bitfield:1;
			uint64_t TC3:1;
			uint64_t TC4:1;
			uint64_t TC5:1;
			uint64_t TC6:1;
			uint64_t TC7:1;
			uint64_t ADC_bitfield:1;
			uint64_t AC_bitfield:1;
			uint64_t DAC_bitfield:1;
			uint64_t reservedSpace0:1;
			uint64_t I2S_bitfield:1;
			uint64_t reservedSpace1:2;
			uint64_t ATW:1;
		} __attribute__((packed)) B;
	} PM_APBCMASK;

