iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMD21/targetInit/SAMD21_sfr.h
	uint8_t res2[16];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t CKRDY:1;
			uint64_t CFD:1;
		} __attribute__((packed)) B;
	} PM_INTENCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t CKRDY:1;
			uint64_t CFD:1;
		} __attribute__((packed)) B;
	} PM_INTENSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t CKRDY:1;
			uint64_t CFD:1;
		} __attribute__((packed)) B;
	} PM_INTFLAG;

	uint8_t res3[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t POR:1;
			uint64_t BOD12:1;
			uint64_t BOD33:1;
			uint64_t reservedSpace0:1;
			uint64_t EXT:1;
			uint64_t WDT_bitfield:1;
			uint64_t SYST:1;
		} __attribute__((packed)) B;
	} PM_RCAUSE;

} __attribute__((packed));

#define PM (*(volatile struct PM_tag *) 0x40000400)

struct RTC_RTC_MODE0_tag
{
	union
	{
		uint16_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t MODE:2;
			uint64_t reservedSpace0:3;
			uint64_t MATCHCLR:1;
			uint64_t PRESCALER:4;
		} __attribute__((packed)) B;
	} RTC_CTRL;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t ADDR:6;
			uint64_t reservedSpace0:8;
			uint64_t RCONT:1;
			uint64_t RREQ:1;
		} __attribute__((packed)) B;
	} RTC_READREQ;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t PEREO0:1;
			uint64_t PEREO1:1;
			uint64_t PEREO2:1;
			uint64_t PEREO3:1;
			uint64_t PEREO4:1;
			uint64_t PEREO5:1;
			uint64_t PEREO6:1;
			uint64_t PEREO7:1;
			uint64_t CMPEO0:1;
			uint64_t reservedSpace0:6;
			uint64_t OVFEO:1;
		} __attribute__((packed)) B;
	} RTC_EVCTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t CMP0:1;
			uint64_t reservedSpace0:5;
			uint64_t SYNCRDY:1;
			uint64_t OVF:1;
		} __attribute__((packed)) B;
	} RTC_INTENCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t CMP0:1;
			uint64_t reservedSpace0:5;
			uint64_t SYNCRDY:1;
			uint64_t OVF:1;
		} __attribute__((packed)) B;
	} RTC_INTENSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t CMP0:1;
			uint64_t reservedSpace0:5;
			uint64_t SYNCRDY:1;
			uint64_t OVF:1;
		} __attribute__((packed)) B;
	} RTC_INTFLAG;

	uint8_t res0[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:7;
			uint64_t SYNCBUSY:1;
		} __attribute__((packed)) B;
	} RTC_STATUS;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DBGRUN:1;
		} __attribute__((packed)) B;
	} RTC_DBGCTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t VALUE:7;
			uint64_t SIGN:1;
		} __attribute__((packed)) B;
	} RTC_FREQCORR;

	uint8_t res1[3];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} RTC_COUNT;

	uint8_t res2[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COMP:32;
		} __attribute__((packed)) B;
	} RTC_COMP0;

} __attribute__((packed));

#define RTC_RTC_MODE0 (*(volatile struct RTC_RTC_MODE0_tag *) 0x40001400)

struct RTC_RTC_MODE1_tag
{
	union
	{
		uint16_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t MODE:2;
			uint64_t reservedSpace0:4;
			uint64_t PRESCALER:4;
		} __attribute__((packed)) B;
	} RTC_CTRL;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t ADDR:6;
			uint64_t reservedSpace0:8;
			uint64_t RCONT:1;
			uint64_t RREQ:1;
		} __attribute__((packed)) B;
	} RTC_READREQ;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t PEREO0:1;
			uint64_t PEREO1:1;
			uint64_t PEREO2:1;
			uint64_t PEREO3:1;
			uint64_t PEREO4:1;
			uint64_t PEREO5:1;
			uint64_t PEREO6:1;
			uint64_t PEREO7:1;
			uint64_t CMPEO0:1;
			uint64_t CMPEO1:1;
			uint64_t reservedSpace0:5;
			uint64_t OVFEO:1;
		} __attribute__((packed)) B;
	} RTC_EVCTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t CMP0:1;
			uint64_t CMP1:1;
			uint64_t reservedSpace0:4;
			uint64_t SYNCRDY:1;
			uint64_t OVF:1;
		} __attribute__((packed)) B;
	} RTC_INTENCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t CMP0:1;
			uint64_t CMP1:1;
			uint64_t reservedSpace0:4;
			uint64_t SYNCRDY:1;
			uint64_t OVF:1;
		} __attribute__((packed)) B;
	} RTC_INTENSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t CMP0:1;
			uint64_t CMP1:1;
			uint64_t reservedSpace0:4;
			uint64_t SYNCRDY:1;
			uint64_t OVF:1;
		} __attribute__((packed)) B;
	} RTC_INTFLAG;

	uint8_t res0[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:7;
			uint64_t SYNCBUSY:1;
		} __attribute__((packed)) B;
	} RTC_STATUS;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DBGRUN:1;
		} __attribute__((packed)) B;
	} RTC_DBGCTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t VALUE:7;
			uint64_t SIGN:1;
		} __attribute__((packed)) B;
	} RTC_FREQCORR;

	uint8_t res1[3];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t COUNT:16;
		} __attribute__((packed)) B;
	} RTC_COUNT;

	uint8_t res2[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t PER:16;
		} __attribute__((packed)) B;
	} RTC_PER;

	uint8_t res3[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t COMP:16;
		} __attribute__((packed)) B;
	} RTC_COMP0;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t COMP:16;
		} __attribute__((packed)) B;
	} RTC_COMP1;

} __attribute__((packed));

#define RTC_RTC_MODE1 (*(volatile struct RTC_RTC_MODE1_tag *) 0x40001400)

struct RTC_RTC_MODE2_tag
{
	union
	{
		uint16_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t MODE:2;
			uint64_t reservedSpace0:2;
			uint64_t CLKREP:1;
			uint64_t MATCHCLR:1;
			uint64_t PRESCALER:4;
		} __attribute__((packed)) B;
	} RTC_CTRL;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t ADDR:6;
			uint64_t reservedSpace0:8;
			uint64_t RCONT:1;
			uint64_t RREQ:1;
		} __attribute__((packed)) B;
	} RTC_READREQ;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t PEREO0:1;
			uint64_t PEREO1:1;
			uint64_t PEREO2:1;
			uint64_t PEREO3:1;
			uint64_t PEREO4:1;
			uint64_t PEREO5:1;
			uint64_t PEREO6:1;
			uint64_t PEREO7:1;
			uint64_t ALARMEO0:1;
			uint64_t reservedSpace0:6;
			uint64_t OVFEO:1;
		} __attribute__((packed)) B;
	} RTC_EVCTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t ALARM0:1;
			uint64_t reservedSpace0:5;
			uint64_t SYNCRDY:1;
			uint64_t OVF:1;
		} __attribute__((packed)) B;
	} RTC_INTENCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t ALARM0:1;
			uint64_t reservedSpace0:5;
			uint64_t SYNCRDY:1;
			uint64_t OVF:1;
		} __attribute__((packed)) B;
	} RTC_INTENSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t ALARM0:1;
			uint64_t reservedSpace0:5;
			uint64_t SYNCRDY:1;
			uint64_t OVF:1;
		} __attribute__((packed)) B;
	} RTC_INTFLAG;

	uint8_t res0[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:7;
			uint64_t SYNCBUSY:1;
		} __attribute__((packed)) B;
	} RTC_STATUS;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DBGRUN:1;
		} __attribute__((packed)) B;
	} RTC_DBGCTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t VALUE:7;
			uint64_t SIGN:1;
		} __attribute__((packed)) B;
	} RTC_FREQCORR;

	uint8_t res1[3];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SECOND:6;
			uint64_t MINUTE:6;
			uint64_t HOUR:5;
			uint64_t DAY:5;
			uint64_t MONTH:4;
			uint64_t YEAR:6;
		} __attribute__((packed)) B;
	} RTC_CLOCK;

