iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMD21/targetInit/SAMD21_sfr.h
#define SERCOM5_SERCOM_USART (*(volatile struct SERCOM5_SERCOM_USART_tag *) 0x42001c00)

struct SYSCTRL_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t XOSCRDY:1;
			uint64_t XOSC32KRDY:1;
			uint64_t OSC32KRDY:1;
			uint64_t OSC8MRDY:1;
			uint64_t DFLLRDY:1;
			uint64_t DFLLOOB:1;
			uint64_t DFLLLCKF:1;
			uint64_t DFLLLCKC:1;
			uint64_t DFLLRCS:1;
			uint64_t BOD33RDY:1;
			uint64_t BOD33DET:1;
			uint64_t B33SRDY:1;
			uint64_t reservedSpace0:3;
			uint64_t DPLLLCKR:1;
			uint64_t DPLLLCKF:1;
			uint64_t DPLLLTO:1;
		} __attribute__((packed)) B;
	} SYSCTRL_INTENCLR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XOSCRDY:1;
			uint64_t XOSC32KRDY:1;
			uint64_t OSC32KRDY:1;
			uint64_t OSC8MRDY:1;
			uint64_t DFLLRDY:1;
			uint64_t DFLLOOB:1;
			uint64_t DFLLLCKF:1;
			uint64_t DFLLLCKC:1;
			uint64_t DFLLRCS:1;
			uint64_t BOD33RDY:1;
			uint64_t BOD33DET:1;
			uint64_t B33SRDY:1;
			uint64_t reservedSpace0:3;
			uint64_t DPLLLCKR:1;
			uint64_t DPLLLCKF:1;
			uint64_t DPLLLTO:1;
		} __attribute__((packed)) B;
	} SYSCTRL_INTENSET;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XOSCRDY:1;
			uint64_t XOSC32KRDY:1;
			uint64_t OSC32KRDY:1;
			uint64_t OSC8MRDY:1;
			uint64_t DFLLRDY:1;
			uint64_t DFLLOOB:1;
			uint64_t DFLLLCKF:1;
			uint64_t DFLLLCKC:1;
			uint64_t DFLLRCS:1;
			uint64_t BOD33RDY:1;
			uint64_t BOD33DET:1;
			uint64_t B33SRDY:1;
			uint64_t reservedSpace0:3;
			uint64_t DPLLLCKR:1;
			uint64_t DPLLLCKF:1;
			uint64_t DPLLLTO:1;
		} __attribute__((packed)) B;
	} SYSCTRL_INTFLAG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t XOSCRDY:1;
			uint64_t XOSC32KRDY:1;
			uint64_t OSC32KRDY:1;
			uint64_t OSC8MRDY:1;
			uint64_t DFLLRDY:1;
			uint64_t DFLLOOB:1;
			uint64_t DFLLLCKF:1;
			uint64_t DFLLLCKC:1;
			uint64_t DFLLRCS:1;
			uint64_t BOD33RDY:1;
			uint64_t BOD33DET:1;
			uint64_t B33SRDY:1;
			uint64_t reservedSpace0:3;
			uint64_t DPLLLCKR:1;
			uint64_t DPLLLCKF:1;
			uint64_t DPLLLTO:1;
		} __attribute__((packed)) B;
	} SYSCTRL_PCLKSR;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t ENABLE:1;
			uint64_t XTALEN:1;
			uint64_t reservedSpace1:3;
			uint64_t RUNSTDBY:1;
			uint64_t ONDEMAND:1;
			uint64_t GAIN:3;
			uint64_t AMPGC:1;
			uint64_t STARTUP:4;
		} __attribute__((packed)) B;
	} SYSCTRL_XOSC;

	uint8_t res0[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t ENABLE:1;
			uint64_t XTALEN:1;
			uint64_t EN32K:1;
			uint64_t EN1K:1;
			uint64_t AAMPEN:1;
			uint64_t RUNSTDBY:1;
			uint64_t ONDEMAND:1;
			uint64_t STARTUP:3;
			uint64_t reservedSpace1:1;
			uint64_t WRTLOCK:1;
		} __attribute__((packed)) B;
	} SYSCTRL_XOSC32K;

	uint8_t res1[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t ENABLE:1;
			uint64_t EN32K:1;
			uint64_t EN1K:1;
			uint64_t reservedSpace1:2;
			uint64_t RUNSTDBY:1;
			uint64_t ONDEMAND:1;
			uint64_t STARTUP:3;
			uint64_t reservedSpace2:1;
			uint64_t WRTLOCK:1;
			uint64_t reservedSpace3:3;
			uint64_t CALIB:7;
		} __attribute__((packed)) B;
	} SYSCTRL_OSC32K;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t CALIB:5;
			uint64_t reservedSpace0:2;
			uint64_t WRTLOCK:1;
		} __attribute__((packed)) B;
	} SYSCTRL_OSCULP32K;

	uint8_t res2[3];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t ENABLE:1;
			uint64_t reservedSpace1:4;
			uint64_t RUNSTDBY:1;
			uint64_t ONDEMAND:1;
			uint64_t PRESC:2;
			uint64_t reservedSpace2:6;
			uint64_t CALIB:12;
			uint64_t reservedSpace3:2;
			uint64_t FRANGE:2;
		} __attribute__((packed)) B;
	} SYSCTRL_OSC8M;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t ENABLE:1;
			uint64_t MODE:1;
			uint64_t STABLE:1;
			uint64_t LLAW:1;
			uint64_t USBCRM:1;
			uint64_t RUNSTDBY:1;
			uint64_t ONDEMAND:1;
			uint64_t CCDIS:1;
			uint64_t QLDIS:1;
			uint64_t BPLCKC:1;
			uint64_t WAITLOCK:1;
		} __attribute__((packed)) B;
	} SYSCTRL_DFLLCTRL;

	uint8_t res3[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FINE:10;
			uint64_t COARSE:6;
			uint64_t DIFF:16;
		} __attribute__((packed)) B;
	} SYSCTRL_DFLLVAL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t MUL:16;
			uint64_t FSTEP:10;
			uint64_t CSTEP:6;
		} __attribute__((packed)) B;
	} SYSCTRL_DFLLMUL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:7;
			uint64_t READREQ:1;
		} __attribute__((packed)) B;
	} SYSCTRL_DFLLSYNC;

	uint8_t res4[3];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t ENABLE:1;
			uint64_t HYST:1;
			uint64_t ACTION:2;
			uint64_t reservedSpace1:1;
			uint64_t RUNSTDBY:1;
			uint64_t reservedSpace2:1;
			uint64_t MODE:1;
			uint64_t CEN:1;
			uint64_t reservedSpace3:2;
			uint64_t PSEL:4;
			uint64_t LEVEL:6;
		} __attribute__((packed)) B;
	} SYSCTRL_BOD33;

	uint8_t res5[8];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t TSEN:1;
			uint64_t BGOUTEN:1;
			uint64_t reservedSpace1:13;
			uint64_t CALIB:11;
		} __attribute__((packed)) B;
	} SYSCTRL_VREF;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t ENABLE:1;
			uint64_t reservedSpace1:4;
			uint64_t RUNSTDBY:1;
			uint64_t ONDEMAND:1;
		} __attribute__((packed)) B;
	} SYSCTRL_DPLLCTRLA;

	uint8_t res6[3];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t LDR:12;
			uint64_t reservedSpace0:4;
			uint64_t LDRFRAC:4;
		} __attribute__((packed)) B;
	} SYSCTRL_DPLLRATIO;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t FILTER:2;
			uint64_t LPEN:1;
			uint64_t WUF:1;
			uint64_t REFCLK:2;
			uint64_t reservedSpace0:2;
			uint64_t LTIME:3;
			uint64_t reservedSpace1:1;
			uint64_t LBYPASS:1;
			uint64_t reservedSpace2:3;
			uint64_t DIV:11;
		} __attribute__((packed)) B;
	} SYSCTRL_DPLLCTRLB;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t LOCK:1;
			uint64_t CLKRDY:1;
			uint64_t ENABLE:1;
			uint64_t DIV:1;
		} __attribute__((packed)) B;
	} SYSCTRL_DPLLSTATUS;

} __attribute__((packed));

