iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMD21/targetInit/SAMD21_sfr.h
#define SYSCTRL (*(volatile struct SYSCTRL_tag *) 0x40000800)

struct TC3_TC_COUNT8_tag
{
	union
	{
		uint16_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t MODE:2;
			uint64_t reservedSpace0:1;
			uint64_t WAVEGEN:2;
			uint64_t reservedSpace1:1;
			uint64_t PRESCALER:3;
			uint64_t RUNSTDBY:1;
			uint64_t PRESCSYNC:2;
		} __attribute__((packed)) B;
	} TC_CTRLA;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t ADDR:5;
			uint64_t reservedSpace0:9;
			uint64_t RCONT:1;
			uint64_t RREQ:1;
		} __attribute__((packed)) B;
	} TC_READREQ;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DIR:1;
			uint64_t reservedSpace0:1;
			uint64_t ONESHOT:1;
			uint64_t reservedSpace1:3;
			uint64_t CMD:2;
		} __attribute__((packed)) B;
	} TC_CTRLBCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DIR:1;
			uint64_t reservedSpace0:1;
			uint64_t ONESHOT:1;
			uint64_t reservedSpace1:3;
			uint64_t CMD:2;
		} __attribute__((packed)) B;
	} TC_CTRLBSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t INVEN0:1;
			uint64_t INVEN1:1;
			uint64_t reservedSpace0:2;
			uint64_t CPTEN0:1;
			uint64_t CPTEN1:1;
		} __attribute__((packed)) B;
	} TC_CTRLC;

	uint8_t res0[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DBGRUN:1;
		} __attribute__((packed)) B;
	} TC_DBGCTRL;

	uint8_t res1[1];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t EVACT:3;
			uint64_t reservedSpace0:1;
			uint64_t TCINV:1;
			uint64_t TCEI:1;
			uint64_t reservedSpace1:2;
			uint64_t OVFEO:1;
			uint64_t reservedSpace2:3;
			uint64_t MCEO0:1;
			uint64_t MCEO1:1;
		} __attribute__((packed)) B;
	} TC_EVCTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:1;
			uint64_t SYNCRDY:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
		} __attribute__((packed)) B;
	} TC_INTENCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:1;
			uint64_t SYNCRDY:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
		} __attribute__((packed)) B;
	} TC_INTENSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:1;
			uint64_t SYNCRDY:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
		} __attribute__((packed)) B;
	} TC_INTFLAG;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:3;
			uint64_t STOP:1;
			uint64_t SLAVE:1;
			uint64_t reservedSpace1:2;
			uint64_t SYNCBUSY:1;
		} __attribute__((packed)) B;
	} TC_STATUS;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t COUNT:8;
		} __attribute__((packed)) B;
	} TC_COUNT;

	uint8_t res2[3];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t PER:8;
		} __attribute__((packed)) B;
	} TC_PER;

	uint8_t res3[3];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t CC:8;
		} __attribute__((packed)) B;
	} TC_CC0;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t CC:8;
		} __attribute__((packed)) B;
	} TC_CC1;

} __attribute__((packed));

#define TC3_TC_COUNT8 (*(volatile struct TC3_TC_COUNT8_tag *) 0x42002c00)

struct TC3_TC_COUNT16_tag
{
	union
	{
		uint16_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t MODE:2;
			uint64_t reservedSpace0:1;
			uint64_t WAVEGEN:2;
			uint64_t reservedSpace1:1;
			uint64_t PRESCALER:3;
			uint64_t RUNSTDBY:1;
			uint64_t PRESCSYNC:2;
		} __attribute__((packed)) B;
	} TC_CTRLA;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t ADDR:5;
			uint64_t reservedSpace0:9;
			uint64_t RCONT:1;
			uint64_t RREQ:1;
		} __attribute__((packed)) B;
	} TC_READREQ;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DIR:1;
			uint64_t reservedSpace0:1;
			uint64_t ONESHOT:1;
			uint64_t reservedSpace1:3;
			uint64_t CMD:2;
		} __attribute__((packed)) B;
	} TC_CTRLBCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DIR:1;
			uint64_t reservedSpace0:1;
			uint64_t ONESHOT:1;
			uint64_t reservedSpace1:3;
			uint64_t CMD:2;
		} __attribute__((packed)) B;
	} TC_CTRLBSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t INVEN0:1;
			uint64_t INVEN1:1;
			uint64_t reservedSpace0:2;
			uint64_t CPTEN0:1;
			uint64_t CPTEN1:1;
		} __attribute__((packed)) B;
	} TC_CTRLC;

	uint8_t res0[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DBGRUN:1;
		} __attribute__((packed)) B;
	} TC_DBGCTRL;

	uint8_t res1[1];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t EVACT:3;
			uint64_t reservedSpace0:1;
			uint64_t TCINV:1;
			uint64_t TCEI:1;
			uint64_t reservedSpace1:2;
			uint64_t OVFEO:1;
			uint64_t reservedSpace2:3;
			uint64_t MCEO0:1;
			uint64_t MCEO1:1;
		} __attribute__((packed)) B;
	} TC_EVCTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:1;
			uint64_t SYNCRDY:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
		} __attribute__((packed)) B;
	} TC_INTENCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:1;
			uint64_t SYNCRDY:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
		} __attribute__((packed)) B;
	} TC_INTENSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:1;
			uint64_t SYNCRDY:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
		} __attribute__((packed)) B;
	} TC_INTFLAG;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:3;
			uint64_t STOP:1;
			uint64_t SLAVE:1;
			uint64_t reservedSpace1:2;
			uint64_t SYNCBUSY:1;
		} __attribute__((packed)) B;
	} TC_STATUS;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t COUNT:16;
		} __attribute__((packed)) B;
	} TC_COUNT;

	uint8_t res2[6];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t CC:16;
		} __attribute__((packed)) B;
	} TC_CC0;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t CC:16;
		} __attribute__((packed)) B;
	} TC_CC1;

} __attribute__((packed));

#define TC3_TC_COUNT16 (*(volatile struct TC3_TC_COUNT16_tag *) 0x42002c00)

struct TC3_TC_COUNT32_tag
{
	union
	{
		uint16_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t MODE:2;
			uint64_t reservedSpace0:1;
			uint64_t WAVEGEN:2;
			uint64_t reservedSpace1:1;
			uint64_t PRESCALER:3;
			uint64_t RUNSTDBY:1;
			uint64_t PRESCSYNC:2;
		} __attribute__((packed)) B;
	} TC_CTRLA;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t ADDR:5;
			uint64_t reservedSpace0:9;
			uint64_t RCONT:1;
			uint64_t RREQ:1;
		} __attribute__((packed)) B;
	} TC_READREQ;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DIR:1;
			uint64_t reservedSpace0:1;
			uint64_t ONESHOT:1;
			uint64_t reservedSpace1:3;
			uint64_t CMD:2;
		} __attribute__((packed)) B;
	} TC_CTRLBCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DIR:1;
			uint64_t reservedSpace0:1;
			uint64_t ONESHOT:1;
			uint64_t reservedSpace1:3;
			uint64_t CMD:2;
		} __attribute__((packed)) B;
	} TC_CTRLBSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t INVEN0:1;
			uint64_t INVEN1:1;
			uint64_t reservedSpace0:2;
			uint64_t CPTEN0:1;
			uint64_t CPTEN1:1;
		} __attribute__((packed)) B;
	} TC_CTRLC;

	uint8_t res0[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DBGRUN:1;
		} __attribute__((packed)) B;
	} TC_DBGCTRL;

	uint8_t res1[1];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t EVACT:3;
			uint64_t reservedSpace0:1;
			uint64_t TCINV:1;
			uint64_t TCEI:1;
			uint64_t reservedSpace1:2;
			uint64_t OVFEO:1;
			uint64_t reservedSpace2:3;
			uint64_t MCEO0:1;
			uint64_t MCEO1:1;
		} __attribute__((packed)) B;
	} TC_EVCTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:1;
			uint64_t SYNCRDY:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
		} __attribute__((packed)) B;
	} TC_INTENCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:1;
			uint64_t SYNCRDY:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
		} __attribute__((packed)) B;
	} TC_INTENSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:1;
			uint64_t SYNCRDY:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
		} __attribute__((packed)) B;
	} TC_INTFLAG;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:3;
			uint64_t STOP:1;
			uint64_t SLAVE:1;
			uint64_t reservedSpace1:2;
			uint64_t SYNCBUSY:1;
		} __attribute__((packed)) B;
	} TC_STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} TC_COUNT;

