iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMD21/targetInit/SAMD21_sfr.h
#define TC7_TC_COUNT16 (*(volatile struct TC7_TC_COUNT16_tag *) 0x42003c00)

struct TC7_TC_COUNT32_tag
{
	union
	{
		uint16_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t MODE:2;
			uint64_t reservedSpace0:1;
			uint64_t WAVEGEN:2;
			uint64_t reservedSpace1:1;
			uint64_t PRESCALER:3;
			uint64_t RUNSTDBY:1;
			uint64_t PRESCSYNC:2;
		} __attribute__((packed)) B;
	} TC_CTRLA;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t ADDR:5;
			uint64_t reservedSpace0:9;
			uint64_t RCONT:1;
			uint64_t RREQ:1;
		} __attribute__((packed)) B;
	} TC_READREQ;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DIR:1;
			uint64_t reservedSpace0:1;
			uint64_t ONESHOT:1;
			uint64_t reservedSpace1:3;
			uint64_t CMD:2;
		} __attribute__((packed)) B;
	} TC_CTRLBCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DIR:1;
			uint64_t reservedSpace0:1;
			uint64_t ONESHOT:1;
			uint64_t reservedSpace1:3;
			uint64_t CMD:2;
		} __attribute__((packed)) B;
	} TC_CTRLBSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t INVEN0:1;
			uint64_t INVEN1:1;
			uint64_t reservedSpace0:2;
			uint64_t CPTEN0:1;
			uint64_t CPTEN1:1;
		} __attribute__((packed)) B;
	} TC_CTRLC;

	uint8_t res0[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DBGRUN:1;
		} __attribute__((packed)) B;
	} TC_DBGCTRL;

	uint8_t res1[1];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t EVACT:3;
			uint64_t reservedSpace0:1;
			uint64_t TCINV:1;
			uint64_t TCEI:1;
			uint64_t reservedSpace1:2;
			uint64_t OVFEO:1;
			uint64_t reservedSpace2:3;
			uint64_t MCEO0:1;
			uint64_t MCEO1:1;
		} __attribute__((packed)) B;
	} TC_EVCTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:1;
			uint64_t SYNCRDY:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
		} __attribute__((packed)) B;
	} TC_INTENCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:1;
			uint64_t SYNCRDY:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
		} __attribute__((packed)) B;
	} TC_INTENSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:1;
			uint64_t SYNCRDY:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
		} __attribute__((packed)) B;
	} TC_INTFLAG;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:3;
			uint64_t STOP:1;
			uint64_t SLAVE:1;
			uint64_t reservedSpace1:2;
			uint64_t SYNCBUSY:1;
		} __attribute__((packed)) B;
	} TC_STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:32;
		} __attribute__((packed)) B;
	} TC_COUNT;

	uint8_t res2[4];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC:32;
		} __attribute__((packed)) B;
	} TC_CC0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC:32;
		} __attribute__((packed)) B;
	} TC_CC1;

} __attribute__((packed));

#define TC7_TC_COUNT32 (*(volatile struct TC7_TC_COUNT32_tag *) 0x42003c00)

struct TCC0_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t reservedSpace0:3;
			uint64_t RESOLUTION:2;
			uint64_t reservedSpace1:1;
			uint64_t PRESCALER:3;
			uint64_t RUNSTDBY:1;
			uint64_t PRESCSYNC:2;
			uint64_t ALOCK:1;
			uint64_t MSYNC:1;
			uint64_t reservedSpace2:8;
			uint64_t CPTEN0:1;
			uint64_t CPTEN1:1;
			uint64_t CPTEN2:1;
			uint64_t CPTEN3:1;
		} __attribute__((packed)) B;
	} TCC_CTRLA;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DIR:1;
			uint64_t LUPD:1;
			uint64_t ONESHOT:1;
			uint64_t IDXCMD:2;
			uint64_t CMD:3;
		} __attribute__((packed)) B;
	} TCC_CTRLBCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DIR:1;
			uint64_t LUPD:1;
			uint64_t ONESHOT:1;
			uint64_t IDXCMD:2;
			uint64_t CMD:3;
		} __attribute__((packed)) B;
	} TCC_CTRLBSET;

	uint8_t res0[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t CTRLB:1;
			uint64_t STATUS:1;
			uint64_t COUNT:1;
			uint64_t PATT:1;
			uint64_t WAVE:1;
			uint64_t PER:1;
			uint64_t CC0:1;
			uint64_t CC1:1;
			uint64_t CC2:1;
			uint64_t CC3:1;
			uint64_t reservedSpace0:4;
			uint64_t PATTB:1;
			uint64_t WAVEB:1;
			uint64_t PERB:1;
			uint64_t CCB0:1;
			uint64_t CCB1:1;
			uint64_t CCB2:1;
			uint64_t CCB3:1;
		} __attribute__((packed)) B;
	} TCC_SYNCBUSY;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRC:2;
			uint64_t reservedSpace0:1;
			uint64_t KEEP:1;
			uint64_t QUAL:1;
			uint64_t BLANK:2;
			uint64_t RESTART:1;
			uint64_t HALT:2;
			uint64_t CHSEL:2;
			uint64_t CAPTURE:3;
			uint64_t reservedSpace1:1;
			uint64_t BLANKVAL:8;
			uint64_t FILTERVAL:4;
		} __attribute__((packed)) B;
	} TCC_FCTRLA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRC:2;
			uint64_t reservedSpace0:1;
			uint64_t KEEP:1;
			uint64_t QUAL:1;
			uint64_t BLANK:2;
			uint64_t RESTART:1;
			uint64_t HALT:2;
			uint64_t CHSEL:2;
			uint64_t CAPTURE:3;
			uint64_t reservedSpace1:1;
			uint64_t BLANKVAL:8;
			uint64_t FILTERVAL:4;
		} __attribute__((packed)) B;
	} TCC_FCTRLB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OTMX:2;
			uint64_t reservedSpace0:6;
			uint64_t DTIEN0:1;
			uint64_t DTIEN1:1;
			uint64_t DTIEN2:1;
			uint64_t DTIEN3:1;
			uint64_t reservedSpace1:4;
			uint64_t DTLS:8;
			uint64_t DTHS:8;
		} __attribute__((packed)) B;
	} TCC_WEXCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t NRE0:1;
			uint64_t NRE1:1;
			uint64_t NRE2:1;
			uint64_t NRE3:1;
			uint64_t NRE4:1;
			uint64_t NRE5:1;
			uint64_t NRE6:1;
			uint64_t NRE7:1;
			uint64_t NRV0:1;
			uint64_t NRV1:1;
			uint64_t NRV2:1;
			uint64_t NRV3:1;
			uint64_t NRV4:1;
			uint64_t NRV5:1;
			uint64_t NRV6:1;
			uint64_t NRV7:1;
			uint64_t INVEN0:1;
			uint64_t INVEN1:1;
			uint64_t INVEN2:1;
			uint64_t INVEN3:1;
			uint64_t INVEN4:1;
			uint64_t INVEN5:1;
			uint64_t INVEN6:1;
			uint64_t INVEN7:1;
			uint64_t FILTERVAL0:4;
			uint64_t FILTERVAL1:4;
		} __attribute__((packed)) B;
	} TCC_DRVCTRL;

	uint8_t res1[2];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DBGRUN:1;
			uint64_t reservedSpace0:1;
			uint64_t FDDBD:1;
		} __attribute__((packed)) B;
	} TCC_DBGCTRL;

	uint8_t res2[1];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EVACT0:3;
			uint64_t EVACT1:3;
			uint64_t CNTSEL:2;
			uint64_t OVFEO:1;
			uint64_t TRGEO:1;
			uint64_t CNTEO:1;
			uint64_t reservedSpace0:1;
			uint64_t TCINV0:1;
			uint64_t TCINV1:1;
			uint64_t TCEI0:1;
			uint64_t TCEI1:1;
			uint64_t MCEI0:1;
			uint64_t MCEI1:1;
			uint64_t MCEI2:1;
			uint64_t MCEI3:1;
			uint64_t reservedSpace1:4;
			uint64_t MCEO0:1;
			uint64_t MCEO1:1;
			uint64_t MCEO2:1;
			uint64_t MCEO3:1;
		} __attribute__((packed)) B;
	} TCC_EVCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t TRG:1;
			uint64_t CNT:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:7;
			uint64_t DFS:1;
			uint64_t FAULTA:1;
			uint64_t FAULTB:1;
			uint64_t FAULT0:1;
			uint64_t FAULT1:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
			uint64_t MC2:1;
			uint64_t MC3:1;
		} __attribute__((packed)) B;
	} TCC_INTENCLR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t TRG:1;
			uint64_t CNT:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:7;
			uint64_t DFS:1;
			uint64_t FAULTA:1;
			uint64_t FAULTB:1;
			uint64_t FAULT0:1;
			uint64_t FAULT1:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
			uint64_t MC2:1;
			uint64_t MC3:1;
		} __attribute__((packed)) B;
	} TCC_INTENSET;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t TRG:1;
			uint64_t CNT:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:7;
			uint64_t DFS:1;
			uint64_t FAULTA:1;
			uint64_t FAULTB:1;
			uint64_t FAULT0:1;
			uint64_t FAULT1:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
			uint64_t MC2:1;
			uint64_t MC3:1;
		} __attribute__((packed)) B;
	} TCC_INTFLAG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STOP:1;
			uint64_t IDX:1;
			uint64_t reservedSpace0:1;
			uint64_t DFS:1;
			uint64_t reservedSpace1:1;
			uint64_t PATTBV:1;
			uint64_t WAVEBV:1;
			uint64_t PERBV:1;
			uint64_t FAULTAIN:1;
			uint64_t FAULTBIN:1;
			uint64_t FAULT0IN:1;
			uint64_t FAULT1IN:1;
			uint64_t FAULTA:1;
			uint64_t FAULTB:1;
			uint64_t FAULT0:1;
			uint64_t FAULT1:1;
			uint64_t CCBV0:1;
			uint64_t CCBV1:1;
			uint64_t CCBV2:1;
			uint64_t CCBV3:1;
			uint64_t reservedSpace2:4;
			uint64_t CMP0:1;
			uint64_t CMP1:1;
			uint64_t CMP2:1;
			uint64_t CMP3:1;
		} __attribute__((packed)) B;
	} TCC_STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:24;
		} __attribute__((packed)) B;
	} TCC_COUNT;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t PGE0:1;
			uint64_t PGE1:1;
			uint64_t PGE2:1;
			uint64_t PGE3:1;
			uint64_t PGE4:1;
			uint64_t PGE5:1;
			uint64_t PGE6:1;
			uint64_t PGE7:1;
			uint64_t PGV0:1;
			uint64_t PGV1:1;
			uint64_t PGV2:1;
			uint64_t PGV3:1;
			uint64_t PGV4:1;
			uint64_t PGV5:1;
			uint64_t PGV6:1;
			uint64_t PGV7:1;
		} __attribute__((packed)) B;
	} TCC_PATT;

	uint8_t res3[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t WAVEGEN:3;
			uint64_t reservedSpace0:1;
			uint64_t RAMP:2;
			uint64_t reservedSpace1:1;
			uint64_t CIPEREN:1;
			uint64_t CICCEN0:1;
			uint64_t CICCEN1:1;
			uint64_t CICCEN2:1;
			uint64_t CICCEN3:1;
			uint64_t reservedSpace2:4;
			uint64_t POL0:1;
			uint64_t POL1:1;
			uint64_t POL2:1;
			uint64_t POL3:1;
			uint64_t reservedSpace3:4;
			uint64_t SWAP0:1;
			uint64_t SWAP1:1;
			uint64_t SWAP2:1;
			uint64_t SWAP3:1;
		} __attribute__((packed)) B;
	} TCC_WAVE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PER:24;
		} __attribute__((packed)) B;
	} TCC_PER;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC:24;
		} __attribute__((packed)) B;
	} TCC_CC0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC:24;
		} __attribute__((packed)) B;
	} TCC_CC1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC:24;
		} __attribute__((packed)) B;
	} TCC_CC2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC:24;
		} __attribute__((packed)) B;
	} TCC_CC3;

	uint8_t res4[16];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t PGEB0:1;
			uint64_t PGEB1:1;
			uint64_t PGEB2:1;
			uint64_t PGEB3:1;
			uint64_t PGEB4:1;
			uint64_t PGEB5:1;
			uint64_t PGEB6:1;
			uint64_t PGEB7:1;
			uint64_t PGVB0:1;
			uint64_t PGVB1:1;
			uint64_t PGVB2:1;
			uint64_t PGVB3:1;
			uint64_t PGVB4:1;
			uint64_t PGVB5:1;
			uint64_t PGVB6:1;
			uint64_t PGVB7:1;
		} __attribute__((packed)) B;
	} TCC_PATTB;

	uint8_t res5[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t WAVEGENB:3;
			uint64_t reservedSpace0:1;
			uint64_t RAMPB:2;
			uint64_t reservedSpace1:1;
			uint64_t CIPERENB:1;
			uint64_t CICCENB0:1;
			uint64_t CICCENB1:1;
			uint64_t CICCENB2:1;
			uint64_t CICCENB3:1;
			uint64_t reservedSpace2:4;
			uint64_t POLB0:1;
			uint64_t POLB1:1;
			uint64_t POLB2:1;
			uint64_t POLB3:1;
			uint64_t reservedSpace3:4;
			uint64_t SWAPB0:1;
			uint64_t SWAPB1:1;
			uint64_t SWAPB2:1;
			uint64_t SWAPB3:1;
		} __attribute__((packed)) B;
	} TCC_WAVEB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PERB:24;
		} __attribute__((packed)) B;
	} TCC_PERB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCB:24;
		} __attribute__((packed)) B;
	} TCC_CCB0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCB:24;
		} __attribute__((packed)) B;
	} TCC_CCB1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCB:24;
		} __attribute__((packed)) B;
	} TCC_CCB2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCB:24;
		} __attribute__((packed)) B;
	} TCC_CCB3;

} __attribute__((packed));

#define TCC0 (*(volatile struct TCC0_tag *) 0x42002000)

struct TCC1_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t reservedSpace0:3;
			uint64_t RESOLUTION:2;
			uint64_t reservedSpace1:1;
			uint64_t PRESCALER:3;
			uint64_t RUNSTDBY:1;
			uint64_t PRESCSYNC:2;
			uint64_t ALOCK:1;
			uint64_t MSYNC:1;
			uint64_t reservedSpace2:8;
			uint64_t CPTEN0:1;
			uint64_t CPTEN1:1;
			uint64_t CPTEN2:1;
			uint64_t CPTEN3:1;
		} __attribute__((packed)) B;
	} TCC_CTRLA;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DIR:1;
			uint64_t LUPD:1;
			uint64_t ONESHOT:1;
			uint64_t IDXCMD:2;
			uint64_t CMD:3;
		} __attribute__((packed)) B;
	} TCC_CTRLBCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DIR:1;
			uint64_t LUPD:1;
			uint64_t ONESHOT:1;
			uint64_t IDXCMD:2;
			uint64_t CMD:3;
		} __attribute__((packed)) B;
	} TCC_CTRLBSET;

	uint8_t res0[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t CTRLB:1;
			uint64_t STATUS:1;
			uint64_t COUNT:1;
			uint64_t PATT:1;
			uint64_t WAVE:1;
			uint64_t PER:1;
			uint64_t CC0:1;
			uint64_t CC1:1;
			uint64_t CC2:1;
			uint64_t CC3:1;
			uint64_t reservedSpace0:4;
			uint64_t PATTB:1;
			uint64_t WAVEB:1;
			uint64_t PERB:1;
			uint64_t CCB0:1;
			uint64_t CCB1:1;
			uint64_t CCB2:1;
			uint64_t CCB3:1;
		} __attribute__((packed)) B;
	} TCC_SYNCBUSY;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRC:2;
			uint64_t reservedSpace0:1;
			uint64_t KEEP:1;
			uint64_t QUAL:1;
			uint64_t BLANK:2;
			uint64_t RESTART:1;
			uint64_t HALT:2;
			uint64_t CHSEL:2;
			uint64_t CAPTURE:3;
			uint64_t reservedSpace1:1;
			uint64_t BLANKVAL:8;
			uint64_t FILTERVAL:4;
		} __attribute__((packed)) B;
	} TCC_FCTRLA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRC:2;
			uint64_t reservedSpace0:1;
			uint64_t KEEP:1;
			uint64_t QUAL:1;
			uint64_t BLANK:2;
			uint64_t RESTART:1;
			uint64_t HALT:2;
			uint64_t CHSEL:2;
			uint64_t CAPTURE:3;
			uint64_t reservedSpace1:1;
			uint64_t BLANKVAL:8;
			uint64_t FILTERVAL:4;
		} __attribute__((packed)) B;
	} TCC_FCTRLB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OTMX:2;
			uint64_t reservedSpace0:6;
			uint64_t DTIEN0:1;
			uint64_t DTIEN1:1;
			uint64_t DTIEN2:1;
			uint64_t DTIEN3:1;
			uint64_t reservedSpace1:4;
			uint64_t DTLS:8;
			uint64_t DTHS:8;
		} __attribute__((packed)) B;
	} TCC_WEXCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t NRE0:1;
			uint64_t NRE1:1;
			uint64_t NRE2:1;
			uint64_t NRE3:1;
			uint64_t NRE4:1;
			uint64_t NRE5:1;
			uint64_t NRE6:1;
			uint64_t NRE7:1;
			uint64_t NRV0:1;
			uint64_t NRV1:1;
			uint64_t NRV2:1;
			uint64_t NRV3:1;
			uint64_t NRV4:1;
			uint64_t NRV5:1;
			uint64_t NRV6:1;
			uint64_t NRV7:1;
			uint64_t INVEN0:1;
			uint64_t INVEN1:1;
			uint64_t INVEN2:1;
			uint64_t INVEN3:1;
			uint64_t INVEN4:1;
			uint64_t INVEN5:1;
			uint64_t INVEN6:1;
			uint64_t INVEN7:1;
			uint64_t FILTERVAL0:4;
			uint64_t FILTERVAL1:4;
		} __attribute__((packed)) B;
	} TCC_DRVCTRL;

	uint8_t res1[2];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DBGRUN:1;
			uint64_t reservedSpace0:1;
			uint64_t FDDBD:1;
		} __attribute__((packed)) B;
	} TCC_DBGCTRL;

	uint8_t res2[1];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EVACT0:3;
			uint64_t EVACT1:3;
			uint64_t CNTSEL:2;
			uint64_t OVFEO:1;
			uint64_t TRGEO:1;
			uint64_t CNTEO:1;
			uint64_t reservedSpace0:1;
			uint64_t TCINV0:1;
			uint64_t TCINV1:1;
			uint64_t TCEI0:1;
			uint64_t TCEI1:1;
			uint64_t MCEI0:1;
			uint64_t MCEI1:1;
			uint64_t MCEI2:1;
			uint64_t MCEI3:1;
			uint64_t reservedSpace1:4;
			uint64_t MCEO0:1;
			uint64_t MCEO1:1;
			uint64_t MCEO2:1;
			uint64_t MCEO3:1;
		} __attribute__((packed)) B;
	} TCC_EVCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t TRG:1;
			uint64_t CNT:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:7;
			uint64_t DFS:1;
			uint64_t FAULTA:1;
			uint64_t FAULTB:1;
			uint64_t FAULT0:1;
			uint64_t FAULT1:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
			uint64_t MC2:1;
			uint64_t MC3:1;
		} __attribute__((packed)) B;
	} TCC_INTENCLR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t TRG:1;
			uint64_t CNT:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:7;
			uint64_t DFS:1;
			uint64_t FAULTA:1;
			uint64_t FAULTB:1;
			uint64_t FAULT0:1;
			uint64_t FAULT1:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
			uint64_t MC2:1;
			uint64_t MC3:1;
		} __attribute__((packed)) B;
	} TCC_INTENSET;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t TRG:1;
			uint64_t CNT:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:7;
			uint64_t DFS:1;
			uint64_t FAULTA:1;
			uint64_t FAULTB:1;
			uint64_t FAULT0:1;
			uint64_t FAULT1:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
			uint64_t MC2:1;
			uint64_t MC3:1;
		} __attribute__((packed)) B;
	} TCC_INTFLAG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STOP:1;
			uint64_t IDX:1;
			uint64_t reservedSpace0:1;
			uint64_t DFS:1;
			uint64_t reservedSpace1:1;
			uint64_t PATTBV:1;
			uint64_t WAVEBV:1;
			uint64_t PERBV:1;
			uint64_t FAULTAIN:1;
			uint64_t FAULTBIN:1;
			uint64_t FAULT0IN:1;
			uint64_t FAULT1IN:1;
			uint64_t FAULTA:1;
			uint64_t FAULTB:1;
			uint64_t FAULT0:1;
			uint64_t FAULT1:1;
			uint64_t CCBV0:1;
			uint64_t CCBV1:1;
			uint64_t CCBV2:1;
			uint64_t CCBV3:1;
			uint64_t reservedSpace2:4;
			uint64_t CMP0:1;
			uint64_t CMP1:1;
			uint64_t CMP2:1;
			uint64_t CMP3:1;
		} __attribute__((packed)) B;
	} TCC_STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:24;
		} __attribute__((packed)) B;
	} TCC_COUNT;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t PGE0:1;
			uint64_t PGE1:1;
			uint64_t PGE2:1;
			uint64_t PGE3:1;
			uint64_t PGE4:1;
			uint64_t PGE5:1;
			uint64_t PGE6:1;
			uint64_t PGE7:1;
			uint64_t PGV0:1;
			uint64_t PGV1:1;
			uint64_t PGV2:1;
			uint64_t PGV3:1;
			uint64_t PGV4:1;
			uint64_t PGV5:1;
			uint64_t PGV6:1;
			uint64_t PGV7:1;
		} __attribute__((packed)) B;
	} TCC_PATT;

	uint8_t res3[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t WAVEGEN:3;
			uint64_t reservedSpace0:1;
			uint64_t RAMP:2;
			uint64_t reservedSpace1:1;
			uint64_t CIPEREN:1;
			uint64_t CICCEN0:1;
			uint64_t CICCEN1:1;
			uint64_t CICCEN2:1;
			uint64_t CICCEN3:1;
			uint64_t reservedSpace2:4;
			uint64_t POL0:1;
			uint64_t POL1:1;
			uint64_t POL2:1;
			uint64_t POL3:1;
			uint64_t reservedSpace3:4;
			uint64_t SWAP0:1;
			uint64_t SWAP1:1;
			uint64_t SWAP2:1;
			uint64_t SWAP3:1;
		} __attribute__((packed)) B;
	} TCC_WAVE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PER:24;
		} __attribute__((packed)) B;
	} TCC_PER;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC:24;
		} __attribute__((packed)) B;
	} TCC_CC0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC:24;
		} __attribute__((packed)) B;
	} TCC_CC1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC:24;
		} __attribute__((packed)) B;
	} TCC_CC2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC:24;
		} __attribute__((packed)) B;
	} TCC_CC3;

	uint8_t res4[16];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t PGEB0:1;
			uint64_t PGEB1:1;
			uint64_t PGEB2:1;
			uint64_t PGEB3:1;
			uint64_t PGEB4:1;
			uint64_t PGEB5:1;
			uint64_t PGEB6:1;
			uint64_t PGEB7:1;
			uint64_t PGVB0:1;
			uint64_t PGVB1:1;
			uint64_t PGVB2:1;
			uint64_t PGVB3:1;
			uint64_t PGVB4:1;
			uint64_t PGVB5:1;
			uint64_t PGVB6:1;
			uint64_t PGVB7:1;
		} __attribute__((packed)) B;
	} TCC_PATTB;

	uint8_t res5[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t WAVEGENB:3;
			uint64_t reservedSpace0:1;
			uint64_t RAMPB:2;
			uint64_t reservedSpace1:1;
			uint64_t CIPERENB:1;
			uint64_t CICCENB0:1;
			uint64_t CICCENB1:1;
			uint64_t CICCENB2:1;
			uint64_t CICCENB3:1;
			uint64_t reservedSpace2:4;
			uint64_t POLB0:1;
			uint64_t POLB1:1;
			uint64_t POLB2:1;
			uint64_t POLB3:1;
			uint64_t reservedSpace3:4;
			uint64_t SWAPB0:1;
			uint64_t SWAPB1:1;
			uint64_t SWAPB2:1;
			uint64_t SWAPB3:1;
		} __attribute__((packed)) B;
	} TCC_WAVEB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PERB:24;
		} __attribute__((packed)) B;
	} TCC_PERB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCB:24;
		} __attribute__((packed)) B;
	} TCC_CCB0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCB:24;
		} __attribute__((packed)) B;
	} TCC_CCB1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCB:24;
		} __attribute__((packed)) B;
	} TCC_CCB2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCB:24;
		} __attribute__((packed)) B;
	} TCC_CCB3;

} __attribute__((packed));

#define TCC1 (*(volatile struct TCC1_tag *) 0x42002400)

struct TCC2_tag
{
	union
	{
		uint32_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t reservedSpace0:3;
			uint64_t RESOLUTION:2;
			uint64_t reservedSpace1:1;
			uint64_t PRESCALER:3;
			uint64_t RUNSTDBY:1;
			uint64_t PRESCSYNC:2;
			uint64_t ALOCK:1;
			uint64_t MSYNC:1;
			uint64_t reservedSpace2:8;
			uint64_t CPTEN0:1;
			uint64_t CPTEN1:1;
			uint64_t CPTEN2:1;
			uint64_t CPTEN3:1;
		} __attribute__((packed)) B;
	} TCC_CTRLA;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DIR:1;
			uint64_t LUPD:1;
			uint64_t ONESHOT:1;
			uint64_t IDXCMD:2;
			uint64_t CMD:3;
		} __attribute__((packed)) B;
	} TCC_CTRLBCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DIR:1;
			uint64_t LUPD:1;
			uint64_t ONESHOT:1;
			uint64_t IDXCMD:2;
			uint64_t CMD:3;
		} __attribute__((packed)) B;
	} TCC_CTRLBSET;

	uint8_t res0[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t CTRLB:1;
			uint64_t STATUS:1;
			uint64_t COUNT:1;
			uint64_t PATT:1;
			uint64_t WAVE:1;
			uint64_t PER:1;
			uint64_t CC0:1;
			uint64_t CC1:1;
			uint64_t CC2:1;
			uint64_t CC3:1;
			uint64_t reservedSpace0:4;
			uint64_t PATTB:1;
			uint64_t WAVEB:1;
			uint64_t PERB:1;
			uint64_t CCB0:1;
			uint64_t CCB1:1;
			uint64_t CCB2:1;
			uint64_t CCB3:1;
		} __attribute__((packed)) B;
	} TCC_SYNCBUSY;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRC:2;
			uint64_t reservedSpace0:1;
			uint64_t KEEP:1;
			uint64_t QUAL:1;
			uint64_t BLANK:2;
			uint64_t RESTART:1;
			uint64_t HALT:2;
			uint64_t CHSEL:2;
			uint64_t CAPTURE:3;
			uint64_t reservedSpace1:1;
			uint64_t BLANKVAL:8;
			uint64_t FILTERVAL:4;
		} __attribute__((packed)) B;
	} TCC_FCTRLA;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t SRC:2;
			uint64_t reservedSpace0:1;
			uint64_t KEEP:1;
			uint64_t QUAL:1;
			uint64_t BLANK:2;
			uint64_t RESTART:1;
			uint64_t HALT:2;
			uint64_t CHSEL:2;
			uint64_t CAPTURE:3;
			uint64_t reservedSpace1:1;
			uint64_t BLANKVAL:8;
			uint64_t FILTERVAL:4;
		} __attribute__((packed)) B;
	} TCC_FCTRLB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OTMX:2;
			uint64_t reservedSpace0:6;
			uint64_t DTIEN0:1;
			uint64_t DTIEN1:1;
			uint64_t DTIEN2:1;
			uint64_t DTIEN3:1;
			uint64_t reservedSpace1:4;
			uint64_t DTLS:8;
			uint64_t DTHS:8;
		} __attribute__((packed)) B;
	} TCC_WEXCTRL;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t NRE0:1;
			uint64_t NRE1:1;
			uint64_t NRE2:1;
			uint64_t NRE3:1;
			uint64_t NRE4:1;
			uint64_t NRE5:1;
			uint64_t NRE6:1;
			uint64_t NRE7:1;
			uint64_t NRV0:1;
			uint64_t NRV1:1;
			uint64_t NRV2:1;
			uint64_t NRV3:1;
			uint64_t NRV4:1;
			uint64_t NRV5:1;
			uint64_t NRV6:1;
			uint64_t NRV7:1;
			uint64_t INVEN0:1;
			uint64_t INVEN1:1;
			uint64_t INVEN2:1;
			uint64_t INVEN3:1;
			uint64_t INVEN4:1;
			uint64_t INVEN5:1;
			uint64_t INVEN6:1;
			uint64_t INVEN7:1;
			uint64_t FILTERVAL0:4;
			uint64_t FILTERVAL1:4;
		} __attribute__((packed)) B;
	} TCC_DRVCTRL;

	uint8_t res1[2];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DBGRUN:1;
			uint64_t reservedSpace0:1;
			uint64_t FDDBD:1;
		} __attribute__((packed)) B;
	} TCC_DBGCTRL;

	uint8_t res2[1];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t EVACT0:3;
			uint64_t EVACT1:3;
			uint64_t CNTSEL:2;
			uint64_t OVFEO:1;
			uint64_t TRGEO:1;
			uint64_t CNTEO:1;
			uint64_t reservedSpace0:1;
			uint64_t TCINV0:1;
			uint64_t TCINV1:1;
			uint64_t TCEI0:1;
			uint64_t TCEI1:1;
			uint64_t MCEI0:1;
			uint64_t MCEI1:1;
			uint64_t MCEI2:1;
			uint64_t MCEI3:1;
			uint64_t reservedSpace1:4;
			uint64_t MCEO0:1;
			uint64_t MCEO1:1;
			uint64_t MCEO2:1;
			uint64_t MCEO3:1;
		} __attribute__((packed)) B;
	} TCC_EVCTRL;

