iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMD21/targetInit/SAMD21_sfr.h
	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t TRG:1;
			uint64_t CNT:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:7;
			uint64_t DFS:1;
			uint64_t FAULTA:1;
			uint64_t FAULTB:1;
			uint64_t FAULT0:1;
			uint64_t FAULT1:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
			uint64_t MC2:1;
			uint64_t MC3:1;
		} __attribute__((packed)) B;
	} TCC_INTENCLR;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t TRG:1;
			uint64_t CNT:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:7;
			uint64_t DFS:1;
			uint64_t FAULTA:1;
			uint64_t FAULTB:1;
			uint64_t FAULT0:1;
			uint64_t FAULT1:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
			uint64_t MC2:1;
			uint64_t MC3:1;
		} __attribute__((packed)) B;
	} TCC_INTENSET;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t OVF:1;
			uint64_t TRG:1;
			uint64_t CNT:1;
			uint64_t ERR:1;
			uint64_t reservedSpace0:7;
			uint64_t DFS:1;
			uint64_t FAULTA:1;
			uint64_t FAULTB:1;
			uint64_t FAULT0:1;
			uint64_t FAULT1:1;
			uint64_t MC0:1;
			uint64_t MC1:1;
			uint64_t MC2:1;
			uint64_t MC3:1;
		} __attribute__((packed)) B;
	} TCC_INTFLAG;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t STOP:1;
			uint64_t IDX:1;
			uint64_t reservedSpace0:1;
			uint64_t DFS:1;
			uint64_t reservedSpace1:1;
			uint64_t PATTBV:1;
			uint64_t WAVEBV:1;
			uint64_t PERBV:1;
			uint64_t FAULTAIN:1;
			uint64_t FAULTBIN:1;
			uint64_t FAULT0IN:1;
			uint64_t FAULT1IN:1;
			uint64_t FAULTA:1;
			uint64_t FAULTB:1;
			uint64_t FAULT0:1;
			uint64_t FAULT1:1;
			uint64_t CCBV0:1;
			uint64_t CCBV1:1;
			uint64_t CCBV2:1;
			uint64_t CCBV3:1;
			uint64_t reservedSpace2:4;
			uint64_t CMP0:1;
			uint64_t CMP1:1;
			uint64_t CMP2:1;
			uint64_t CMP3:1;
		} __attribute__((packed)) B;
	} TCC_STATUS;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t COUNT:24;
		} __attribute__((packed)) B;
	} TCC_COUNT;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t PGE0:1;
			uint64_t PGE1:1;
			uint64_t PGE2:1;
			uint64_t PGE3:1;
			uint64_t PGE4:1;
			uint64_t PGE5:1;
			uint64_t PGE6:1;
			uint64_t PGE7:1;
			uint64_t PGV0:1;
			uint64_t PGV1:1;
			uint64_t PGV2:1;
			uint64_t PGV3:1;
			uint64_t PGV4:1;
			uint64_t PGV5:1;
			uint64_t PGV6:1;
			uint64_t PGV7:1;
		} __attribute__((packed)) B;
	} TCC_PATT;

	uint8_t res3[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t WAVEGEN:3;
			uint64_t reservedSpace0:1;
			uint64_t RAMP:2;
			uint64_t reservedSpace1:1;
			uint64_t CIPEREN:1;
			uint64_t CICCEN0:1;
			uint64_t CICCEN1:1;
			uint64_t CICCEN2:1;
			uint64_t CICCEN3:1;
			uint64_t reservedSpace2:4;
			uint64_t POL0:1;
			uint64_t POL1:1;
			uint64_t POL2:1;
			uint64_t POL3:1;
			uint64_t reservedSpace3:4;
			uint64_t SWAP0:1;
			uint64_t SWAP1:1;
			uint64_t SWAP2:1;
			uint64_t SWAP3:1;
		} __attribute__((packed)) B;
	} TCC_WAVE;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PER:24;
		} __attribute__((packed)) B;
	} TCC_PER;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC:24;
		} __attribute__((packed)) B;
	} TCC_CC0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC:24;
		} __attribute__((packed)) B;
	} TCC_CC1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC:24;
		} __attribute__((packed)) B;
	} TCC_CC2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CC:24;
		} __attribute__((packed)) B;
	} TCC_CC3;

	uint8_t res4[16];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t PGEB0:1;
			uint64_t PGEB1:1;
			uint64_t PGEB2:1;
			uint64_t PGEB3:1;
			uint64_t PGEB4:1;
			uint64_t PGEB5:1;
			uint64_t PGEB6:1;
			uint64_t PGEB7:1;
			uint64_t PGVB0:1;
			uint64_t PGVB1:1;
			uint64_t PGVB2:1;
			uint64_t PGVB3:1;
			uint64_t PGVB4:1;
			uint64_t PGVB5:1;
			uint64_t PGVB6:1;
			uint64_t PGVB7:1;
		} __attribute__((packed)) B;
	} TCC_PATTB;

	uint8_t res5[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t WAVEGENB:3;
			uint64_t reservedSpace0:1;
			uint64_t RAMPB:2;
			uint64_t reservedSpace1:1;
			uint64_t CIPERENB:1;
			uint64_t CICCENB0:1;
			uint64_t CICCENB1:1;
			uint64_t CICCENB2:1;
			uint64_t CICCENB3:1;
			uint64_t reservedSpace2:4;
			uint64_t POLB0:1;
			uint64_t POLB1:1;
			uint64_t POLB2:1;
			uint64_t POLB3:1;
			uint64_t reservedSpace3:4;
			uint64_t SWAPB0:1;
			uint64_t SWAPB1:1;
			uint64_t SWAPB2:1;
			uint64_t SWAPB3:1;
		} __attribute__((packed)) B;
	} TCC_WAVEB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t PERB:24;
		} __attribute__((packed)) B;
	} TCC_PERB;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCB:24;
		} __attribute__((packed)) B;
	} TCC_CCB0;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCB:24;
		} __attribute__((packed)) B;
	} TCC_CCB1;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCB:24;
		} __attribute__((packed)) B;
	} TCC_CCB2;

	union
	{
		uint32_t R;
		struct
		{
			uint64_t CCB:24;
		} __attribute__((packed)) B;
	} TCC_CCB3;

} __attribute__((packed));

#define TCC2 (*(volatile struct TCC2_tag *) 0x42002800)

struct USB_USB_DEVICE_tag
{
	union
	{
		uint8_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t RUNSTDBY:1;
			uint64_t reservedSpace0:4;
			uint64_t MODE:1;
		} __attribute__((packed)) B;
	} USB_CTRLA;

	uint8_t res0[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
		} __attribute__((packed)) B;
	} USB_SYNCBUSY;

	uint8_t res1[5];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t DETACH:1;
			uint64_t UPRSM:1;
			uint64_t SPDCONF:2;
			uint64_t NREPLY:1;
			uint64_t TSTJ:1;
			uint64_t TSTK:1;
			uint64_t TSTPCKT:1;
			uint64_t OPMODE2:1;
			uint64_t GNAK:1;
			uint64_t LPMHDSK:2;
		} __attribute__((packed)) B;
	} USB_CTRLB;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DADD:7;
			uint64_t ADDEN:1;
		} __attribute__((packed)) B;
	} USB_DADD;

	uint8_t res2[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:2;
			uint64_t SPEED:2;
			uint64_t reservedSpace1:2;
			uint64_t LINESTATE:2;
		} __attribute__((packed)) B;
	} USB_STATUS;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t FSMSTATE:6;
		} __attribute__((packed)) B;
	} USB_FSMSTATUS;

	uint8_t res3[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t MFNUM:3;
			uint64_t FNUM:11;
			uint64_t reservedSpace0:1;
			uint64_t FNCERR:1;
		} __attribute__((packed)) B;
	} USB_FNUM;

	uint8_t res4[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t SUSPEND:1;
			uint64_t MSOF:1;
			uint64_t SOF:1;
			uint64_t EORST:1;
			uint64_t WAKEUP:1;
			uint64_t EORSM:1;
			uint64_t UPRSM:1;
			uint64_t RAMACER:1;
			uint64_t LPMNYET:1;
			uint64_t LPMSUSP:1;
		} __attribute__((packed)) B;
	} USB_INTENCLR;

	uint8_t res5[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t SUSPEND:1;
			uint64_t MSOF:1;
			uint64_t SOF:1;
			uint64_t EORST:1;
			uint64_t WAKEUP:1;
			uint64_t EORSM:1;
			uint64_t UPRSM:1;
			uint64_t RAMACER:1;
			uint64_t LPMNYET:1;
			uint64_t LPMSUSP:1;
		} __attribute__((packed)) B;
	} USB_INTENSET;

	uint8_t res6[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t SUSPEND:1;
			uint64_t MSOF:1;
			uint64_t SOF:1;
			uint64_t EORST:1;
			uint64_t WAKEUP:1;
			uint64_t EORSM:1;
			uint64_t UPRSM:1;
			uint64_t RAMACER:1;
			uint64_t LPMNYET:1;
			uint64_t LPMSUSP:1;
		} __attribute__((packed)) B;
	} USB_INTFLAG;

	uint8_t res7[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t EPINT0:1;
			uint64_t EPINT1:1;
			uint64_t EPINT2:1;
			uint64_t EPINT3:1;
			uint64_t EPINT4:1;
			uint64_t EPINT5:1;
			uint64_t EPINT6:1;
			uint64_t EPINT7:1;
		} __attribute__((packed)) B;
	} USB_EPINTSMRY;

	uint8_t res8[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DESCADD:32;
		} __attribute__((packed)) B;
	} USB_DESCADD;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t TRANSP:5;
			uint64_t reservedSpace0:1;
			uint64_t TRANSN:5;
			uint64_t reservedSpace1:1;
			uint64_t TRIM:3;
		} __attribute__((packed)) B;
	} USB_PADCAL;

	uint8_t res9[214];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t EPTYPE0:3;
			uint64_t reservedSpace0:1;
			uint64_t EPTYPE1:3;
			uint64_t NYETDIS:1;
		} __attribute__((packed)) B;
	} USB_EPCFG0;

	uint8_t res10[3];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSCLR0;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSSET0;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUS0;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTFLAG0;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENCLR0;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENSET0;

