iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMD21/targetInit/SAMD21_sfr.h
	uint8_t res11[22];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t EPTYPE0:3;
			uint64_t reservedSpace0:1;
			uint64_t EPTYPE1:3;
			uint64_t NYETDIS:1;
		} __attribute__((packed)) B;
	} USB_EPCFG1;

	uint8_t res12[3];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSCLR1;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSSET1;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUS1;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTFLAG1;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENCLR1;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENSET1;

	uint8_t res13[22];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t EPTYPE0:3;
			uint64_t reservedSpace0:1;
			uint64_t EPTYPE1:3;
			uint64_t NYETDIS:1;
		} __attribute__((packed)) B;
	} USB_EPCFG2;

	uint8_t res14[3];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSCLR2;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSSET2;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUS2;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTFLAG2;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENCLR2;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENSET2;

	uint8_t res15[22];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t EPTYPE0:3;
			uint64_t reservedSpace0:1;
			uint64_t EPTYPE1:3;
			uint64_t NYETDIS:1;
		} __attribute__((packed)) B;
	} USB_EPCFG3;

	uint8_t res16[3];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSCLR3;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSSET3;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUS3;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTFLAG3;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENCLR3;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENSET3;

	uint8_t res17[22];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t EPTYPE0:3;
			uint64_t reservedSpace0:1;
			uint64_t EPTYPE1:3;
			uint64_t NYETDIS:1;
		} __attribute__((packed)) B;
	} USB_EPCFG4;

	uint8_t res18[3];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSCLR4;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSSET4;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUS4;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTFLAG4;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENCLR4;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENSET4;

	uint8_t res19[22];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t EPTYPE0:3;
			uint64_t reservedSpace0:1;
			uint64_t EPTYPE1:3;
			uint64_t NYETDIS:1;
		} __attribute__((packed)) B;
	} USB_EPCFG5;

