iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMD21/targetInit/SAMD21_sfr.h
	uint8_t res20[3];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSCLR5;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSSET5;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUS5;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTFLAG5;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENCLR5;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENSET5;

	uint8_t res21[22];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t EPTYPE0:3;
			uint64_t reservedSpace0:1;
			uint64_t EPTYPE1:3;
			uint64_t NYETDIS:1;
		} __attribute__((packed)) B;
	} USB_EPCFG6;

	uint8_t res22[3];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSCLR6;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSSET6;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUS6;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTFLAG6;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENCLR6;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENSET6;

	uint8_t res23[22];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t EPTYPE0:3;
			uint64_t reservedSpace0:1;
			uint64_t EPTYPE1:3;
			uint64_t NYETDIS:1;
		} __attribute__((packed)) B;
	} USB_EPCFG7;

	uint8_t res24[3];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSCLR7;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUSSET7;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGLOUT:1;
			uint64_t DTGLIN:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace0:1;
			uint64_t STALLRQ0:1;
			uint64_t STALLRQ1:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_EPSTATUS7;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTFLAG7;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENCLR7;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL0:1;
			uint64_t TRFAIL1:1;
			uint64_t RXSTP:1;
			uint64_t STALL0:1;
			uint64_t STALL1:1;
		} __attribute__((packed)) B;
	} USB_EPINTENSET7;

} __attribute__((packed));

#define USB_USB_DEVICE (*(volatile struct USB_USB_DEVICE_tag *) 0x41005000)

struct USB_USB_HOST_tag
{
	union
	{
		uint8_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
			uint64_t RUNSTDBY:1;
			uint64_t reservedSpace0:4;
			uint64_t MODE:1;
		} __attribute__((packed)) B;
	} USB_CTRLA;

	uint8_t res0[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t SWRST:1;
			uint64_t ENABLE:1;
		} __attribute__((packed)) B;
	} USB_SYNCBUSY;

	uint8_t res1[5];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t RESUME:1;
			uint64_t SPDCONF:2;
			uint64_t reservedSpace1:1;
			uint64_t TSTJ:1;
			uint64_t TSTK:1;
			uint64_t reservedSpace2:1;
			uint64_t SOFE:1;
			uint64_t BUSRESET:1;
			uint64_t VBUSOK:1;
			uint64_t L1RESUME:1;
		} __attribute__((packed)) B;
	} USB_CTRLB;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t FLENC:4;
			uint64_t reservedSpace0:3;
			uint64_t FLENCE:1;
		} __attribute__((packed)) B;
	} USB_HSOFC;

	uint8_t res2[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:2;
			uint64_t SPEED:2;
			uint64_t reservedSpace1:2;
			uint64_t LINESTATE:2;
		} __attribute__((packed)) B;
	} USB_STATUS;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t FSMSTATE:6;
		} __attribute__((packed)) B;
	} USB_FSMSTATUS;

	uint8_t res3[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t MFNUM:3;
			uint64_t FNUM:11;
		} __attribute__((packed)) B;
	} USB_FNUM;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t FLENHIGH:8;
		} __attribute__((packed)) B;
	} USB_FLENHIGH;

	uint8_t res4[1];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t reservedSpace0:2;
			uint64_t HSOF:1;
			uint64_t RST:1;
			uint64_t WAKEUP:1;
			uint64_t DNRSM:1;
			uint64_t UPRSM:1;
			uint64_t RAMACER:1;
			uint64_t DCONN:1;
			uint64_t DDISC:1;
		} __attribute__((packed)) B;
	} USB_INTENCLR;

	uint8_t res5[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t reservedSpace0:2;
			uint64_t HSOF:1;
			uint64_t RST:1;
			uint64_t WAKEUP:1;
			uint64_t DNRSM:1;
			uint64_t UPRSM:1;
			uint64_t RAMACER:1;
			uint64_t DCONN:1;
			uint64_t DDISC:1;
		} __attribute__((packed)) B;
	} USB_INTENSET;

	uint8_t res6[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t reservedSpace0:2;
			uint64_t HSOF:1;
			uint64_t RST:1;
			uint64_t WAKEUP:1;
			uint64_t DNRSM:1;
			uint64_t UPRSM:1;
			uint64_t RAMACER:1;
			uint64_t DCONN:1;
			uint64_t DDISC:1;
		} __attribute__((packed)) B;
	} USB_INTFLAG;

	uint8_t res7[2];

	union
	{
		uint16_t R;
		struct
		{
			uint64_t EPINT0:1;
			uint64_t EPINT1:1;
			uint64_t EPINT2:1;
			uint64_t EPINT3:1;
			uint64_t EPINT4:1;
			uint64_t EPINT5:1;
			uint64_t EPINT6:1;
			uint64_t EPINT7:1;
		} __attribute__((packed)) B;
	} USB_PINTSMRY;

	uint8_t res8[2];

	union
	{
		uint32_t R;
		struct
		{
			uint64_t DESCADD:32;
		} __attribute__((packed)) B;
	} USB_DESCADD;

	union
	{
		uint16_t R;
		struct
		{
			uint64_t TRANSP:5;
			uint64_t reservedSpace0:1;
			uint64_t TRANSN:5;
			uint64_t reservedSpace1:1;
			uint64_t TRIM:3;
		} __attribute__((packed)) B;
	} USB_PADCAL;

	uint8_t res9[214];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t PTOKEN:2;
			uint64_t BK:1;
			uint64_t PTYPE:3;
		} __attribute__((packed)) B;
	} USB_PCFG0;

	uint8_t res10[2];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t BITINTERVAL:8;
		} __attribute__((packed)) B;
	} USB_BINTERVAL0;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSCLR0;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSSET0;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUS0;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTFLAG0;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENCLR0;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENSET0;

