iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAMD21/targetInit/SAMD21_sfr.h
	uint8_t res11[22];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t PTOKEN:2;
			uint64_t BK:1;
			uint64_t PTYPE:3;
		} __attribute__((packed)) B;
	} USB_PCFG1;

	uint8_t res12[2];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t BITINTERVAL:8;
		} __attribute__((packed)) B;
	} USB_BINTERVAL1;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSCLR1;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSSET1;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUS1;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTFLAG1;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENCLR1;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENSET1;

	uint8_t res13[22];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t PTOKEN:2;
			uint64_t BK:1;
			uint64_t PTYPE:3;
		} __attribute__((packed)) B;
	} USB_PCFG2;

	uint8_t res14[2];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t BITINTERVAL:8;
		} __attribute__((packed)) B;
	} USB_BINTERVAL2;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSCLR2;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSSET2;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUS2;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTFLAG2;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENCLR2;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENSET2;

	uint8_t res15[22];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t PTOKEN:2;
			uint64_t BK:1;
			uint64_t PTYPE:3;
		} __attribute__((packed)) B;
	} USB_PCFG3;

	uint8_t res16[2];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t BITINTERVAL:8;
		} __attribute__((packed)) B;
	} USB_BINTERVAL3;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSCLR3;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSSET3;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUS3;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTFLAG3;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENCLR3;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENSET3;

	uint8_t res17[22];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t PTOKEN:2;
			uint64_t BK:1;
			uint64_t PTYPE:3;
		} __attribute__((packed)) B;
	} USB_PCFG4;

	uint8_t res18[2];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t BITINTERVAL:8;
		} __attribute__((packed)) B;
	} USB_BINTERVAL4;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSCLR4;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSSET4;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUS4;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTFLAG4;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENCLR4;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENSET4;

	uint8_t res19[22];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t PTOKEN:2;
			uint64_t BK:1;
			uint64_t PTYPE:3;
		} __attribute__((packed)) B;
	} USB_PCFG5;

	uint8_t res20[2];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t BITINTERVAL:8;
		} __attribute__((packed)) B;
	} USB_BINTERVAL5;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSCLR5;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSSET5;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUS5;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTFLAG5;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENCLR5;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENSET5;

	uint8_t res21[22];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t PTOKEN:2;
			uint64_t BK:1;
			uint64_t PTYPE:3;
		} __attribute__((packed)) B;
	} USB_PCFG6;

	uint8_t res22[2];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t BITINTERVAL:8;
		} __attribute__((packed)) B;
	} USB_BINTERVAL6;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSCLR6;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSSET6;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUS6;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTFLAG6;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENCLR6;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENSET6;

	uint8_t res23[22];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t PTOKEN:2;
			uint64_t BK:1;
			uint64_t PTYPE:3;
		} __attribute__((packed)) B;
	} USB_PCFG7;

	uint8_t res24[2];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t BITINTERVAL:8;
		} __attribute__((packed)) B;
	} USB_BINTERVAL7;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSCLR7;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUSSET7;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t DTGL:1;
			uint64_t reservedSpace0:1;
			uint64_t CURBK:1;
			uint64_t reservedSpace1:1;
			uint64_t PFREEZE:1;
			uint64_t reservedSpace2:1;
			uint64_t BK0RDY:1;
			uint64_t BK1RDY:1;
		} __attribute__((packed)) B;
	} USB_PSTATUS7;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTFLAG7;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENCLR7;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t TRCPT0:1;
			uint64_t TRCPT1:1;
			uint64_t TRFAIL:1;
			uint64_t PERR:1;
			uint64_t TXSTP:1;
			uint64_t STALL:1;
		} __attribute__((packed)) B;
	} USB_PINTENSET7;

} __attribute__((packed));

#define USB_USB_HOST (*(volatile struct USB_USB_HOST_tag *) 0x41005000)

struct WDT_tag
{
	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:1;
			uint64_t ENABLE:1;
			uint64_t WEN:1;
			uint64_t reservedSpace1:4;
			uint64_t ALWAYSON:1;
		} __attribute__((packed)) B;
	} WDT_CTRL;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t PER:4;
			uint64_t WINDOW:4;
		} __attribute__((packed)) B;
	} WDT_CONFIG;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t EWOFFSET:4;
		} __attribute__((packed)) B;
	} WDT_EWCTRL;

	uint8_t res0[1];

	union
	{
		uint8_t R;
		struct
		{
			uint64_t EW:1;
		} __attribute__((packed)) B;
	} WDT_INTENCLR;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t EW:1;
		} __attribute__((packed)) B;
	} WDT_INTENSET;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t EW:1;
		} __attribute__((packed)) B;
	} WDT_INTFLAG;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t reservedSpace0:7;
			uint64_t SYNCBUSY:1;
		} __attribute__((packed)) B;
	} WDT_STATUS;

	union
	{
		uint8_t R;
		struct
		{
			uint64_t CLEAR:8;
		} __attribute__((packed)) B;
	} WDT_CLEAR;

} __attribute__((packed));

#define WDT (*(volatile struct WDT_tag *) 0x40001000)

